import random
from typing import Union

from bot.database.models.product import Product, ProductType, ProductCategory
from bot.database.models.prompt import Prompt
from bot.database.operations.product.getters import get_product
from bot.helpers.formatters.format_number import format_number
from bot.helpers.getters.get_model_version import get_model_version
from bot.helpers.getters.get_time_until_limit_update import get_time_until_limit_update
from bot.helpers.getters.get_user_discount import get_user_discount
from bot.locales.texts import Texts
from bot.database.models.common import (
    Currency,
    Quota,
    Model,
    ModelType,
    VideoSummaryFocus,
    VideoSummaryFormat,
    VideoSummaryAmount,
    AspectRatio,
    SendType,
)
from bot.database.models.subscription import (
    SubscriptionPeriod,
    SubscriptionStatus,
)
from bot.database.models.user import UserSettings
from bot.locales.types import LanguageCode


class Hindi(Texts):
    # Action
    ACTION_BACK = "◀️ वापस"
    ACTION_CLOSE = "🚪 बंद करें"
    ACTION_CANCEL = "❌ रद्द करें"
    ACTION_APPROVE = "✅ स्वीकृत करें"
    ACTION_DENY = "❌ अस्वीकृत करें"
    ACTION_TO_OTHER_MODELS = "◀️ अन्य मॉडलों पर"
    ACTION_TO_OTHER_TYPE_MODELS = "◀️ अन्य प्रकार के मॉडलों पर"

    # Additional Bot
    @staticmethod
    def additional_bot_info(link: str) -> str:
        return f"""
👋 <b>नमस्ते!</b>

⚠️ <b>यह बॉट अनुरोधों को संसाधित नहीं करता। यह केवल आपको हमारे मुख्य AI सहायक पर पुनः निर्देशित करता है।</b>

🏆 हमारा मिशन है कि हर किसी को सर्वश्रेष्ठ AI मॉडलों तक पहुँच प्रदान की जाए।

👉 {link}
"""

    # Bonus
    @staticmethod
    def bonus_info(balance: int) -> str:
        return f"""
🎁 <b>बोनस बैलेंस</b>

💰 वर्तमान बैलेंस: <b>{int(balance)} क्रेडिट्स</b> 🪙

💡 <b>इसे कैसे उपयोग करें:</b>
• किसी भी एआई मॉडल में अनुरोध करें
• डिजिटल कर्मचारियों तक पहुंच
• वॉयस उत्तर/अनुरोध
• तेज़, बिना रुके उत्तर

कोई कार्रवाई चुनें 👇
"""

    BONUS_EARN = "➕ कमाएं"
    BONUS_SPEND = "➖ खर्च करें"

    @staticmethod
    def bonus_info_earn(user_id: str, referred_count: int, feedback_count: int, play_count: int):
        return f"""
➕ <b>क्रेडिट कैसे कमाएं</b>

👥 <i>दोस्तों को आमंत्रित करें:</i>
• <b>+25 क्रेडिट</b> आपको और आपके दोस्त को
• आमंत्रण लिंक:
{Texts.bonus_referral_link(user_id, False)}
• आपने आमंत्रित किया: {referred_count}

💭 <i>प्रतिक्रिया दें:</i>
• <b>+25 क्रेडिट</b> प्रति प्रतिक्रिया
• आपने प्रतिक्रिया दी: {feedback_count}

🎮 <i>अपनी किस्मत आज़माएं:</i>
• <b>+1-100 क्रेडिट</b> जीत के लिए
• आपने खेला: {play_count}

कोई कार्रवाई चुनें 👇
"""

    @staticmethod
    def bonus_info_spend(balance: int):
        return f"""
💰 वर्तमान बैलेंस: <b>{int(balance)} क्रेडिट्स</b> 🪙

यह चुनें कि <b>अपने क्रेडिट्स कैसे खर्च करें:</b> 👇
"""

    BONUS_ACTIVATED_SUCCESSFUL = """
🌟 <b>बोनस सक्रिय कर दिया गया है!</b>

आपने सफलतापूर्वक पैकेज खरीदे 🚀
"""
    BONUS_INVITE_FRIEND = "👥 दोस्त को आमंत्रित करें"
    BONUS_REFERRAL_SUCCESS = """
🌟 <b>आपकी रेफरल मैजिक काम कर गई!</b>

आपका और आपके दोस्त का बैलेंस <b>25 क्रेडिट्स</b> 🪙 से बढ़ गया है
"""
    BONUS_REFERRAL_LIMIT_ERROR = """
🌟 <b>आपकी रेफरल मैजिक काम कर गई!</b>

दुर्भाग्य से, मैं आपको इनाम नहीं दे सकता क्योंकि सीमा पार हो गई है
"""
    BONUS_LEAVE_FEEDBACK = "📡 प्रतिक्रिया छोड़ें"
    BONUS_CASH_OUT = "🛍 क्रेडिट खर्च करें"
    BONUS_PLAY = "🎮 खेलें"
    BONUS_PLAY_GAME = "🎮 अपनी किस्मत आजमाएं"
    BONUS_PLAY_GAME_CHOOSE = """
🎮 <b>कोई गेम चुनें</b>

👉 <i>आपके पास प्रतिदिन केवल एक प्रयास है</i>
"""
    BONUS_PLAY_BOWLING_GAME = "🎳 बॉलिंग"
    BONUS_PLAY_BOWLING_GAME_INFO = """
🎳 <b>बॉलिंग</b>

<b>‘खेलें’</b> पर टैप करें, और मैं तुरंत गेंद को पिन्स पर फेंक दूंगा! जीतने का मौका <b>100%</b>

गिरे हुए पिन्स की संख्या ही आपके जीते गए क्रेडिट्स की संख्या होगी: <b>1-6</b>
"""
    BONUS_PLAY_SOCCER_GAME = "⚽️ फुटबॉल"
    BONUS_PLAY_SOCCER_GAME_INFO = """
⚽️ <b>फुटबॉल</b>

<b>‘खेलें’</b> पर टैप करें, और मैं गेंद को गोल में फेंक दूंगा! गोल करने और क्रेडिट जीतने का मौका <b>60%</b>

अगर मैं गोल कर दूं, तो आपको <b>5 क्रेडिट्स</b> मिलेंगे
"""
    BONUS_PLAY_BASKETBALL_GAME = "🏀 बास्केटबॉल"
    BONUS_PLAY_BASKETBALL_GAME_INFO = """
🏀 <b>बास्केटबॉल</b>

<b>‘खेलें’</b> पर टैप करें, और मैं गेंद को बास्केट में फेंक दूंगा! बास्केट में सटीक निशाना लगाने का मौका <b>40%</b>

अगर मैं निशाना लगाता हूं, तो आपको <b>10 क्रेडिट्स</b> मिलेंगे
"""
    BONUS_PLAY_DARTS_GAME = "🎯 डार्ट्स"
    BONUS_PLAY_DARTS_GAME_INFO = """
🎯 <b>डार्ट्स</b>

<b>‘खेलें’</b> पर टैप करें, और मैं डार्ट्स को टारगेट पर फेंक दूंगा! केंद्र में निशाना लगाने का मौका <b>~16.67%</b>

अगर मैं निशाना लगाता हूं, तो आपको <b>15 क्रेडिट्स</b> मिलेंगे
"""
    BONUS_PLAY_DICE_GAME = "🎲 पासा"
    BONUS_PLAY_DICE_GAME_INFO = """
🎲 <b>पासा</b>

1 से 6 के बीच कोई संख्या चुनें, और मैं पासा फेंक दूंगा! जीतने का मौका <b>1 में 6</b>

अगर आप सही संख्या का अनुमान लगाते हैं, तो आपको <b>20 क्रेडिट्स</b> मिलेंगे
"""
    BONUS_PLAY_CASINO_GAME = "🎰 कैसीनो"
    BONUS_PLAY_CASINO_GAME_INFO = """
🎰 <b>कैसीनो</b>

<b>‘खेलें’</b> पर टैप करें, और मैं कैसीनो के रील्स को घुमा दूंगा। तीन समान संख्या पाने का मौका लगभग <b>5%</b>। तीन सात पाने का मौका थोड़ा अधिक <b>1%</b>।

• अगर तीन समान संख्या आती हैं, तो आपको <b>50 क्रेडिट्स</b> मिलेंगे
• अगर तीन सात आते हैं, तो आपको <b>100 क्रेडिट्स</b> मिलेंगे
"""
    BONUS_PLAY_GAME_WON = """
🎉 <b>आपने जीत हासिल की!</b>

नए विजय के लिए कल वापस आएं 💪
"""
    BONUS_PLAY_GAME_LOST = """
😔 <b>आज आपकी किस्मत खराब रही...</b>

कल फिर से कोशिश करें—शायद अगली बार आपकी किस्मत चमके! 🍀
"""

    @staticmethod
    def bonus_play_game_reached_limit():
        hours, minutes = get_time_until_limit_update(hours=0)
        return f"""
⏳ <b>ओह, लगता है आपने आज खेला है!</b>

लेकिन चिंता मत करें — कल एक और मौका मिलेगा।

<i>{hours} घंटे {minutes} मिनट</i> में वापस आएं और अपनी क्षमता दिखाएं! 👏
"""

    # Catalog
    CATALOG_INFO = """
    📁 <b>श्रेणियों की सूची</b>

    आवश्यक अनुभाग चुनें और नीचे बटन पर क्लिक करें 👇
    """
    CATALOG_MANAGE = "🎭 सूची प्रबंधन"
    CATALOG_DIGITAL_EMPLOYEES = "🎭 भूमिकाएँ"
    CATALOG_DIGITAL_EMPLOYEES_INFO = """
    🎭 <b>भूमिकाओं की सूची</b>

    नीचे डिजिटल कर्मचारी चुनें 👇
    """
    CATALOG_DIGITAL_EMPLOYEES_FORBIDDEN_ERROR = """
    🔒 <b>आप VIP क्षेत्र में प्रवेश कर चुके हैं!</b>

    फिलहाल आपके पास डिजिटल कर्मचारियों तक पहुँच नहीं है।

    आप इसे नीचे दिए गए बटन पर क्लिक करके प्राप्त कर सकते हैं:
    """
    CATALOG_PROMPTS = "📚 संकेत"
    CATALOG_PROMPTS_CHOOSE_MODEL_TYPE = """
    📚 <b>संकेत सूची</b>

    आवश्यक <b>मॉडल प्रकार</b> चुनें और नीचे बटन पर क्लिक करें 👇
    """
    CATALOG_PROMPTS_CHOOSE_CATEGORY = """
    📚 <b>संकेत सूची</b>

    आवश्यक <b>श्रेणी</b> चुनें और नीचे बटन पर क्लिक करें 👇
    """
    CATALOG_PROMPTS_CHOOSE_SUBCATEGORY = """
📚 <b>संकेत सूची</b>

आवश्यक <b>उप-श्रेणी</b> चुनें और नीचे बटन पर क्लिक करें 👇
"""

    @staticmethod
    def catalog_prompts_choose_prompt(prompts: list[Prompt]):
        prompt_info = ''
        for index, prompt in enumerate(prompts):
            is_last = index == len(prompts) - 1
            left_part = '┣' if not is_last else '┗'
            right_part = '\n' if not is_last else ''
            prompt_name = prompt.names.get(LanguageCode.HI) or prompt.names.get(LanguageCode.EN)
            prompt_info += f'    {left_part} <b>{index + 1}</b>: {prompt_name}{right_part}'

        return f"""
📚 <b>संकेत सूची</b>

प्रॉम्प्ट्स:
{prompt_info}

<b>प्रॉम्प्ट का नंबर चुनें</b> और पूरा विवरण पाने के लिए नीचे दिए गए बटन पर क्लिक करें 👇
"""

    @staticmethod
    def catalog_prompts_info_prompt(prompt: Prompt, products: list[Product]):
        model_info = ''
        for index, product in enumerate(products):
            is_last = index == len(products) - 1
            left_part = '┣' if not is_last else '┗'
            right_part = '\n' if not is_last else ''
            product_name = product.names.get(LanguageCode.HI) or product.names.get(LanguageCode.EN)
            model_info += f'    {left_part} <b>{product_name}</b>{right_part}'

        return f"""
📚 <b>संकेत सूची</b>

आपने प्रॉम्प्ट चुना है: <b>{prompt.names.get(LanguageCode.HI) or prompt.names.get(LanguageCode.EN)}</b>

यह प्रॉम्प्ट इन मॉडलों के लिए उपयुक्त है:
{model_info}

नीचे दिए गए बटन पर क्लिक करके अगला कदम चुनें 👇
"""

    @staticmethod
    def catalog_prompts_examples(products: list[Product]):
        prompt_examples_info = ''
        for index, product in enumerate(products):
            is_last = index == len(products) - 1
            is_first = index == 0
            left_part = '┣' if not is_last else '┗'
            right_part = '\n' if not is_last else ''
            product_name = product.names.get(LanguageCode.HI) or product.names.get(LanguageCode.EN)
            prompt_examples_info += f'{left_part if not is_first else "┏"} <b>{index + 1}</b>: {product_name}{right_part}'

        return prompt_examples_info

    CATALOG_PROMPTS_GET_SHORT_PROMPT = "संक्षिप्त प्रॉम्प्ट प्राप्त करें ⚡️"
    CATALOG_PROMPTS_GET_LONG_PROMPT = "लंबा प्रॉम्प्ट प्राप्त करें 📜"
    CATALOG_PROMPTS_GET_EXAMPLES = "प्रॉम्प्ट के परिणाम देखें 👀"
    CATALOG_PROMPTS_COPY = "प्रॉम्प्ट कॉपी करें 📋"

    # Chats
    @staticmethod
    def chat_info(current_chat_name: str, total_chats: int) -> str:
        return f"""
🗨️ <b>वर्तमान चैट: {current_chat_name}</b>

📈 कुल चैट्स: <b>{total_chats}</b>

नीचे कार्रवाई चुनें 👇
"""

    CHAT_DEFAULT_TITLE = "नई चैट"
    CHAT_MANAGE = "💬 चैट प्रबंधन"
    CHAT_CREATE = "💬 नया चैट बनाएं"
    CHAT_CREATE_SUCCESS = """
🎉 <b>चैट बन गया!</b>

आप /settings में इसे स्विच कर सकते हैं
"""
    CHAT_TYPE_TITLE = "चैट का नाम लिखें"
    CHAT_SWITCH = "🔄 स्विच करें"
    CHAT_SWITCH_FORBIDDEN_ERROR = """
🚨 <b>रुकिए!</b>

आप फिलहाल अपने एकमात्र चैट में हैं

स्विच करने के लिए नया चैट बनाएं
"""
    CHAT_SWITCH_SUCCESS = "चैट सफलतापूर्वक स्विच किया गया 🎉"
    CHAT_RESET = "♻️ रीसेट करें"
    CHAT_RESET_WARNING = """
🧹 <b>चैट रीसेट प्रक्रिया चालू है!</b>

आप सभी संदेश मिटाने और वर्तमान चैट का संदर्भ साफ़ करने जा रहे हैं

क्या आप जारी रखना चाहते हैं?
"""
    CHAT_RESET_SUCCESS = """
🧹<b>चैट सफलतापूर्वक रीसेट हो गया!</b>

अब मैं, एक सोने की मछली की तरह, पहले की बातें याद नहीं रखता 🐠
"""
    CHAT_DELETE = "🗑 हटाएं"
    CHAT_DELETE_FORBIDDEN_ERROR = """
🚨 <b>रुकिए!</b>

यह आपका एकमात्र चैट है, इसे हटाया नहीं जा सकता
"""
    CHAT_DELETE_SUCCESS = "चैट सफलतापूर्वक हटाया गया 🎉"

    # Eightify
    EIGHTIFY = "👀 YouTube सारांश"
    EIGHTIFY_INFO = """
👀 <b>YouTube सारांश</b> की मदद से आप YouTube वीडियो का संक्षिप्त टेक्स्ट सारांश प्राप्त कर सकते हैं।

<b>यह कैसे काम करता है?</b>
🔗 आवश्यक YouTube वीडियो का लिंक भेजें।
✅ मैं वीडियो का विश्लेषण करूंगा और आपको टेक्स्ट सारांश दूंगा।

आपके लिंक का इंतजार है 😊
"""
    EIGHTIFY_VALUE_ERROR = """
🧐 <b>यह YouTube लिंक जैसा नहीं लगता</b>

कृपया, <b>कोई और लिंक भेजें</b>
"""
    EIGHTIFY_VIDEO_ERROR = """
😢 <b>दुर्भाग्य से, मैं इस YouTube वीडियो को प्रोसेस नहीं कर सकता</b>

कृपया, <b>कोई और लिंक भेजें</b>
"""

    # Errors
    ERROR = """
🤒 <b>मुझे एक अज्ञात त्रुटि मिली</b>

कृपया फिर से प्रयास करें या तकनीकी सहायता से संपर्क करें:
"""
    ERROR_NETWORK = """
🤒 <b>मेरा Telegram से कनेक्शन टूट गया</b>

कृपया फिर से प्रयास करें या तकनीकी सहायता से संपर्क करें:
"""
    ERROR_PROMPT_REQUIRED = """
🚨 <b>रुकिए! और प्रॉम्प्ट कहाँ है?</b>

प्रॉम्प्ट के बिना अनुरोध, बिना चीनी की चाय की तरह है — बिल्कुल बेस्वाद ☕️

कुछ लिखें — और जादू शुरू होगा 🪄
"""
    ERROR_PROMPT_TOO_LONG = """
🚨 <b>ओह! यह प्रॉम्प्ट नहीं, यह तो एक उपन्यास है!</b>

पाठ को छोटा करने की कोशिश करें — अन्यथा मॉडल छुट्टी पर चला जाएगा 🌴

मैं एक नया, अधिक संक्षिप्त प्रॉम्प्ट का इंतजार कर रहा हूं ✨
"""
    ERROR_REQUEST_FORBIDDEN = """
🚨 <b>ओह-ओह! आपका अनुरोध सत्यापन से पास नहीं हुआ</b>

मेरे सुरक्षा गार्ड ने कुछ संदिग्ध पाया 🛑

संदेश/फोटो को प्रतिबंधित सामग्री के लिए जांचें और पुनः प्रयास करें 😌
"""
    ERROR_PHOTO_FORBIDDEN = """
⚠️ फोटो भेजना केवल इन मॉडलों में उपलब्ध है:

🔤 <b>टेक्स्ट मॉडल्स</b>:
    ┣ ChatGPT 4.0 Omni Mini ✉️
    ┣ ChatGPT 4.0 Omni 💥
    ┣ ChatGPT o1 🧪
    ┣ Claude 3.5 Sonnet 💫
    ┣ Claude 3.0 Opus 🚀
    ┣ Gemini 2.0 Flash 🏎
    ┣ Gemini 1.5 Pro 💼
    ┣ Gemini 1.0 Ultra 🛡️
    ┗ Grok 2.0 🐦

🖼 <b>ग्राफिक मॉडल्स</b>:
    ┣ 🎨 Midjourney
    ┣ 🦄 Stable Diffusion XL
    ┣ 🧑‍🚀 Stable Diffusion 3.5
    ┣ 🌲 Flux 1.0 Dev
    ┣ 🏔 Flux 1.1 Pro
    ┣ 🌌 Luma Photon
    ┣ 📷 FaceSwap
    ┗ 🪄 Photoshop AI

📹 <b>वीडियो मॉडल्स</b>:
    ┣ 🎬 Kling
    ┣ 🎥 Runway
    ┗ 🐇 Pika

नीचे दिए गए बटन का उपयोग करें, उस मॉडल पर स्विच करने के लिए जो इमेज पढ़ सकती है 👀
"""
    ERROR_PHOTO_REQUIRED = """
⚠️ <b>इस मॉडल में फोटो अनिवार्य है</b>

प्रॉम्प्ट के साथ एक फोटो भेजें
"""
    ERROR_ALBUM_FORBIDDEN = """
⚠️ <b>वर्तमान मॉडल में, मैं एक समय में कई फोटो प्रोसेस नहीं कर सकता</b>

केवल 1 फोटो भेजें
"""
    ERROR_VIDEO_FORBIDDEN = "⚠️ फिलहाल, मैं इस मॉडल में वीडियो पर काम नहीं कर सकता"
    ERROR_DOCUMENT_FORBIDDEN = "⚠️ फिलहाल, मैं ऐसे दस्तावेज़ों पर काम नहीं कर सकता"
    ERROR_STICKER_FORBIDDEN = "⚠️ फिलहाल, मैं स्टिकर्स पर काम नहीं कर सकता"
    ERROR_SERVER_OVERLOADED = """
🫨 <b>अभी सर्वर पर बहुत ज्यादा लोड है</b>

कृपया दोबारा प्रयास करें या थोड़ा इंतजार करें
"""
    ERROR_FILE_TOO_BIG = """
🚧 <b>फाइल बहुत बड़ी है!</b>

मैं केवल 20MB से कम की फाइल प्रोसेस कर सकता हूं

कृपया फिर से प्रयास करें, लेकिन एक छोटी फाइल के साथ 😉
"""
    ERROR_IS_NOT_NUMBER = """
🚧 <b>यह एक संख्या नहीं है!</b>

कृपया दोबारा प्रयास करें, लेकिन एक संख्यात्मक मान के साथ 🔢
"""

    # Examples
    EXAMPLE_INFO = "यहाँ वह है जो आप इस न्यूरल नेटवर्क तक पहुँचने के लिए कर सकते हैं:"

    @staticmethod
    def example_text_model(model: str):
        return f"👇 आपके प्रश्न पर *{model}* इस तरह से उत्तर देता।"

    @staticmethod
    def example_image_model(model: str):
        return f"☝️ आपके प्रश्न पर {model} इस तरह की छवियाँ बनाता।"

    # FaceSwap
    FACE_SWAP_INFO = """
📷 <b>FaceSwap: 3 में से एक विकल्प चुनें</b>

👤 <b>फोटो भेजें</b> — मैं आपकी छवि पर चेहरा बदल दूँगा

✍️ <b>प्रॉम्प्ट लिखें</b> — मैं आपके विवरण के आधार पर आपकी छवि बनाऊँगा

🤹‍♂️ <b>तैयार पैकेज चुनें</b> — मैं तैयार छवियों पर चेहरे बदल दूँगा
"""
    FACE_SWAP_CHOOSE_PHOTO = "👤 फोटो भेजें"
    FACE_SWAP_CHOOSE_PHOTO_INFO = """
👤 <b>फोटो भेजें</b>

1️⃣ एक फोटो भेजें जिसमें आपका चेहरा स्पष्ट रूप से दिखाई दे
2️⃣ मैं आपकी फोटो में चेहरा बदल दूँगा और बाकी सब कुछ वैसा ही रहेगा

💡 जितनी अच्छी गुणवत्ता होगी, उतना अच्छा परिणाम मिलेगा!
"""
    FACE_SWAP_CHOOSE_PROMPT = "✍️ प्रॉम्प्ट लिखें"
    FACE_SWAP_CHOOSE_PROMPT_INFO = """
✍️ <b>प्रॉम्प्ट लिखें</b>

1️⃣ विस्तार से वर्णन करें कि आप किस प्रकार की छवि चाहते हैं
2️⃣ मैं आपके विवरण के आधार पर आपकी छवि बनाऊँगा

💡 जितना अधिक विवरण देंगे, उतना ही सटीक परिणाम मिलेगा!
"""
    FACE_SWAP_CHOOSE_PACKAGE = "🤹‍♂️ पैकेज चुनें"
    FACE_SWAP_CHOOSE_PACKAGE_INFO = """
🤹‍♂️ <b>पैकेज चुनें</b>

1️⃣ तैयार छवि पैकेज में से एक चुनें
2️⃣ मैं सभी छवियों में चेहरे बदल दूँगा

💡 तेज़ और आसान!
"""
    FACE_SWAP_GENERATIONS_IN_PACKAGES_ENDED = """
📷 <b>वाह! सभी पैकेज जनरेशन का उपयोग हो चुका है!</b>

<b>आगे क्या करें?</b>
👤 एक फोटो भेजें जिसमें चेहरा हो — मैं इसे आपके चेहरे से बदल दूंगा
✍️ एक प्रॉम्प्ट लिखें — मैं आपकी तस्वीर के साथ एक नई छवि बनाऊंगा
"""
    FACE_SWAP_MIN_ERROR = """
🤨 <b>रुकिए!</b>

आप 1 से कम छवियां अनुरोध करना चाहते हैं, यह संभव नहीं है

<b>0 से अधिक संख्या दर्ज करें</b>
"""
    FACE_SWAP_MAX_ERROR = """
🤨 <b>रुकिए!</b>

आप हमारे पास मौजूद छवियों से अधिक छवियां मांग रहे हैं

<b>एक छोटी संख्या दर्ज करें</b>
"""
    FACE_SWAP_NO_FACE_FOUND_ERROR = """
🚫 <b>फोटो प्रोसेसिंग में समस्या</b>

दुर्भाग्य से, फोटो में कोई चेहरा नहीं पहचाना जा सका। कृपया एक नई फोटो अपलोड करें जिसमें आपका चेहरा स्पष्ट रूप से दिखाई दे

नई फोटो अपलोड करने के बाद फिर से प्रयास करें 🔄
"""

    @staticmethod
    def face_swap_choose_package(name: str, available_images: int, total_images: int, used_images: int) -> str:
        remain_images = total_images - used_images
        footer_text = f'<b>टाइप करें कि आप कितने फेस स्वैप करना चाहते हैं, या नीचे दिए गए त्वरित चयन बटन में से एक चुनें</b> 👇' if remain_images > 0 else ''

        return f"""
<b>{name}</b>

पैकेज में शामिल हैं: <b>{total_images} छवियाँ</b>

🌠 <b>उपलब्ध जेनरेशन</b>: {available_images} छवियाँ
<i>अगर आपको और चाहिए, तो /buy या /bonus देखें</i>

🔍 <b>उपयोग की गईं</b>: {used_images} छवियाँ
🚀 <b>शेष</b>: {remain_images} छवियाँ

{footer_text}
"""

    @staticmethod
    def face_swap_package_forbidden_error(available_images: int) -> str:
        return f"""
🚧 <b>जेनरेशन पर्याप्त नहीं हैं!</b>

आपके पास केवल <b>{available_images} जेनरेशन</b> शेष हैं

💡 <b>सुझाव:</b> एक छोटा नंबर आज़माएं, या असीमित संभावनाओं के लिए /buy का उपयोग करें!
"""

    # Feedback
    FEEDBACK_INFO = """
📡 <b>प्रतिपुष्टि</b>

मुझे बेहतर बनाने में मदद करें — अपना विचार साझा करें:
• <b>क्या आपको पसंद आया?</b> बताएं
• <b>क्या सुझाव हैं?</b> साझा करें
• <b>कोई समस्या?</b> सूचित करें

आपकी प्रतिक्रिया की प्रतीक्षा कर रहा हूं 💌
"""
    FEEDBACK_SUCCESS = """
🌟 <b>प्रतिपुष्टि प्राप्त हुई!</b>

आपकी राय — सफलता की गुप्त सामग्री है। मैं पहले से ही सुधार करने की तैयारी कर रहा हूं 🍳

आपको <b>25 क्रेडिट</b> मिलेंगे, जैसे ही मेरे निर्माताओं द्वारा आपकी प्रतिपुष्टि की समीक्षा की जाएगी
"""
    FEEDBACK_APPROVED = """
🌟 <b>प्रतिपुष्टि स्वीकृत!</b>

मुझे बेहतर बनाने में मदद करने के लिए धन्यवाद

आपका इनाम: <b>+25 क्रेडिट</b> 🪙
"""
    FEEDBACK_APPROVED_WITH_LIMIT_ERROR = """
🌟 <b>प्रतिपुष्टि स्वीकृत!</b>

मुझे बेहतर बनाने में मदद करने के लिए धन्यवाद

दुर्भाग्यवश, मैं आपको इनाम नहीं दे सकता क्योंकि सीमा पार हो गई है
"""
    FEEDBACK_DENIED = """
🌟 <b>प्रतिपुष्टि अस्वीकृत!</b>

आपकी प्रतिपुष्टि पर्याप्त रूप से रचनात्मक नहीं थी, और मैं आपके बोनस बैलेंस को बढ़ा नहीं सकता 😢
"""

    # Flux
    FLUX_STRICT_SAFETY_TOLERANCE = "🔒 कड़ी"
    FLUX_MIDDLE_SAFETY_TOLERANCE = "🔏 मध्यम"
    FLUX_PERMISSIVE_SAFETY_TOLERANCE = "🔓 नरम"

    # Gemini Video
    GEMINI_VIDEO = "📼 वीडियो सारांश"
    GEMINI_VIDEO_INFO = """
📼 <b>वीडियो सारांश</b> की मदद से आप किसी भी वीडियो का संक्षेप पाठ प्राप्त कर सकते हैं।

<b>यह कैसे काम करता है?</b> आपके पास दो विकल्प हैं:
1.
🔗 आवश्यक वीडियो का लिंक भेजें।
⚠️ वीडियो 1 घंटे से अधिक लंबा नहीं होना चाहिए।
✅ मैं वीडियो का विश्लेषण करूंगा और आपको टेक्स्ट सारांश दूंगा।

2.
🔗 यहाँ Telegram में स्वयं वीडियो भेजें।
⚠️ वीडियो 1 घंटे से अधिक लंबा और 20MB से कम आकार का होना चाहिए।
✅ मैं वीडियो का विश्लेषण करूंगा और आपको टेक्स्ट सारांश दूंगा।

लिंक/वीडियो भेजें 😊
"""
    GEMINI_VIDEO_TOO_LONG_ERROR = """
⚠️ <b>वीडियो की लंबाई 60 मिनट से कम होनी चाहिए</b>

कृपया, <b>कोई अन्य वीडियो भेजें</b>
"""
    GEMINI_VIDEO_VALUE_ERROR = """
⚠️ <b>यह वीडियो लिंक जैसा नहीं लगता</b>

कृपया, <b>कोई अन्य लिंक भेजें</b>
"""

    @staticmethod
    def gemini_video_prompt(
        focus: VideoSummaryFocus,
        format: VideoSummaryFormat,
        amount: VideoSummaryAmount,
    ) -> str:
        if focus == VideoSummaryFocus.INSIGHTFUL:
            focus = "गहन 💡"
        elif focus == VideoSummaryFocus.FUNNY:
            focus = "मज़ेदार 😄"
        elif focus == VideoSummaryFocus.ACTIONABLE:
            focus = "उपयोगी 🛠"
        elif focus == VideoSummaryFocus.CONTROVERSIAL:
            focus = "विवादास्पद 🔥"

        if format == VideoSummaryFormat.LIST:
            format = "1. <इमोजी> विवरण"
        elif format == VideoSummaryFormat.FAQ:
            format = "❔ _प्रश्न_: <प्रश्न>\n❕ _उत्तर_: <उत्तर>"

        if amount == VideoSummaryAmount.AUTO:
            amount = "स्वचालित ⚙️"
        elif amount == VideoSummaryAmount.SHORT:
            amount = "संक्षेप ✂️"
        elif amount == VideoSummaryAmount.DETAILED:
            amount = "विस्तृत 📚"

        return f"""
कृपया दिए गए वीडियो का सुंदर और संरचित सारांश बनाएं। Markdown फॉर्मेट का उपयोग करें:
- सारांश को विषय आधारित खंडों में विभाजित करें, फॉर्मेट: **<इमोजी> विषय का शीर्षक**।
- प्रत्येक खंड में कुछ मुख्य बिंदु शामिल करें, फॉर्मेट: {format}।
- हर बिंदु को स्पष्ट और जानकारीपूर्ण निष्कर्ष के साथ समाप्त करें।
- संरचना में "-" का उपयोग करने से बचें।
- HTML टैग्स का उपयोग न करें।
- मुख्य शब्दों को इस फॉर्मेट में हाइलाइट करें: **मुख्य शब्द**।
- सारांश को ऐसा बनाएं कि यह रोचक, दृश्यात्मक और व्यवस्थित लगे।
- सारांश का फोकस: {focus}।
- उत्तर की लंबाई: {amount}। संक्षेप: 2-3 खंड। स्वचालित: 4-5 खंड। विस्तृत: 6-10 खंड। खंड विषय आधारित होंगे और बिंदुओं की संख्या उत्तर की लंबाई पर निर्भर करेगी।
- उत्तर हिंदी में प्रदान करें।

प्रत्येक बिंदु के लिए अद्वितीय इमोजी का उपयोग करें। उत्तर आकर्षक और स्पष्ट रूप से संरचित होना चाहिए, बिना किसी परिचयात्मक टिप्पणी के।
"""

    # Gender
    GENDER_CHOOSE = "🚹🚺 अपना लिंग चुनें"
    GENDER_CHANGE = "🚹🚺 अपना लिंग बदलें"
    GENDER_UNSPECIFIED = "🤷 अज्ञात"
    GENDER_MALE = "👕 पुरुष"
    GENDER_FEMALE = "👚 महिला"

    # Generation
    GENERATION_IMAGE_SUCCESS = "✨ यह रहा आपका बनाया हुआ चित्र 🎨"
    GENERATION_VIDEO_SUCCESS = "✨ यह रही आपकी बनाई हुई वीडियो 🎞"

    # Help
    HELP_INFO = """
🛟 <b>सहायता और कमांड</b>

─────────────

👋 <b>सामान्य कमांड:</b>
/start — मेरे बारे में
/profile — आपकी प्रोफ़ाइल
/language — भाषा बदलें
/buy — सदस्यता/पैकेज खरीदें
/bonus — बोनस के बारे में जानें
/promo_code — प्रोमो कोड सक्रिय करें
/feedback — प्रतिक्रिया दें
/terms — उपयोगकर्ता समझौता

─────────────

🤖 <b>न्यूरल नेटवर्क्स:</b>
/model — न्यूरल नेटवर्क चुनें
/info — न्यूरल नेटवर्क्स के बारे में जानें
/catalog — भूमिकाओं और संकेतों की सूची
/settings — मॉडल्स की सेटिंग

─────────────

🔤 <b>टेक्स्ट न्यूरल नेटवर्क्स:</b>
/chatgpt — ChatGPT चुनें
/claude — Claude चुनें
/gemini — Gemini चुनें
/grok — Grok चुनें
/perplexity — Perplexity चुनें

─────────────

📝 <b>न्यूरल नेटवर्क का सारांश:</b>
/youtube_summary — YouTube सारांश चुनें
/video_summary — वीडियो सारांश चुनें

─────────────

🖼 <b>ग्राफिक्स न्यूरल नेटवर्क्स:</b>
/dalle — DALL-E चुनें
/midjourney — Midjourney चुनें
/stable_diffusion — Stable Diffusion चुनें
/flux — Flux चुनें
/luma_photon — Luma Photon चुनें
/recraft — Recraft चुनें
/face_swap — FaceSwap चुनें
/photoshop — Photoshop AI चुनें

─────────────

🎵 <b>संगीत न्यूरल नेटवर्क्स:</b>
/music_gen — MusicGen चुनें
/suno — Suno चुनें

─────────────

📹 <b>वीडियो न्यूरल नेटवर्क्स:</b>
/kling — Kling चुनें
/runway — Runway चुनें
/luma_ray — Luma Ray चुनें
/pika — Pika चुनें

─────────────

किसी भी प्रश्न के लिए, आप तकनीकी सहायता से संपर्क कर सकते हैं:
"""

    # Info
    INFO = "🤖 <b>उन मॉडल्स का प्रकार चुनें, जिनके बारे में आप जानकारी प्राप्त करना चाहते हैं:</b>"
    INFO_TEXT_MODELS = "🤖 <b>उस टेक्स्ट मॉडल का चयन करें, जिसके बारे में आप जानकारी प्राप्त करना चाहते हैं:</b>"
    INFO_IMAGE_MODELS = "🤖 <b>उस ग्राफिक्स मॉडल का चयन करें, जिसके बारे में आप जानकारी प्राप्त करना चाहते हैं:</b>"
    INFO_MUSIC_MODELS = "🤖 <b>उस म्यूज़िक मॉडल का चयन करें, जिसके बारे में आप जानकारी प्राप्त करना चाहते हैं:</b>"
    INFO_VIDEO_MODELS = "🤖 <b>उस वीडियो मॉडल का चयन करें, जिसके बारे में आप जानकारी प्राप्त करना चाहते हैं:</b>"
    INFO_CHAT_GPT = "🤖 <b>ChatGPT मॉडल का चयन करें</b>, जिसके बारे में आप जानकारी प्राप्त करना चाहते हैं:"
    INFO_CHAT_GPT_4_OMNI_MINI = f"""
<b>{Texts.CHAT_GPT_4_OMNI_MINI}</b>

<b>निर्माता:</b> OpenAI

💡<b>उपयोग के विकल्प:</b>
• सामग्री निर्माण
• विचार निर्माण
• कॉपीराइटिंग
• संवाद और सहायता
• जटिल अवधारणाओं की व्याख्या
• प्रश्नों का उत्तर
• एक भाषा से दूसरी भाषा में अनुवाद
• अध्ययन में सहायता
• समस्याओं को हल करने में सहायता
• पाठ के साथ काम करना
• कोड के साथ काम करना
• सिफारिशें

🚦 <b>रेटिंग:</b>
• छवियों पर काम: हां 🟢
• उत्तरों की गुणवत्ता: औसत से ऊपर 🟢
• उत्तर की गति: तेज 🟢

📊 <b>परीक्षण:</b>
• MMLU: 82.0%
• GPQA: 40.2%
• DROP: 79.7%
• MGSM: 87.0%
• MATH: 70.2%
• HumanEval: 87.2%
• MMMU: 59.4%
• MathVista: 56.7%
"""
    INFO_CHAT_GPT_4_OMNI = f"""
<b>{Texts.CHAT_GPT_4_OMNI}</b>

<b>निर्माता:</b> OpenAI

💡<b>उपयोग के विकल्प:</b>
• सामग्री निर्माण
• विचार निर्माण
• कॉपीराइटिंग
• संवाद और सहायता
• जटिल अवधारणाओं की व्याख्या
• प्रश्नों का उत्तर
• एक भाषा से दूसरी भाषा में अनुवाद
• अध्ययन में सहायता
• समस्याओं को हल करने में सहायता
• पाठ के साथ काम करना
• कोड के साथ काम करना
• सिफारिशें

🚦 <b>रेटिंग:</b>
• छवियों पर काम: हां 🟢
• उत्तरों की गुणवत्ता: उच्च 🟢
• उत्तर की गति: औसत से तेज 🟢

📊 <b>परीक्षण:</b>
• MMLU: 88.7%
• GPQA: 53.6%
• DROP: 83.4%
• MGSM: 90.5%
• MATH: 76.6%
• HumanEval: 90.2%
• MMMU: 69.1%
• MathVista: 63.8%
"""
    INFO_CHAT_GPT_O_3_MINI = f"""
<b>{Texts.CHAT_GPT_O_3_MINI}</b>

<b>निर्माता:</b> OpenAI

💡<b>उपयोग के विकल्प:</b>
• सामग्री निर्माण
• जटिल अवधारणाओं की व्याख्या
• प्रश्नों का उत्तर
• एक भाषा से दूसरी भाषा में अनुवाद
• अध्ययन में सहायता
• समस्याओं को हल करने में सहायता
• पाठ के साथ काम करना
• कोड के साथ काम करना

🚦 <b>रेटिंग:</b>
• छवियों पर काम: नहीं 🔴
• उत्तरों की गुणवत्ता: उच्च 🟢
• उत्तर की गति: औसत 🟡

📊 <b>परीक्षण:</b>
• MMLU: 86.9%
• GPQA: 79.7%
• MATH: 97.9%
• HumanEval: 92.4%
"""
    INFO_CHAT_GPT_O_1 = f"""
<b>{Texts.CHAT_GPT_O_1}</b>

<b>निर्माता:</b> OpenAI

💡<b>उपयोग के विकल्प:</b>
• सामग्री निर्माण
• जटिल अवधारणाओं की व्याख्या
• प्रश्नों का उत्तर
• एक भाषा से दूसरी भाषा में अनुवाद
• अध्ययन में सहायता
• समस्याओं को हल करने में सहायता
• पाठ के साथ काम करना
• कोड के साथ काम करना

🚦 <b>रेटिंग:</b>
• छवियों पर काम: हां 🟢
• उत्तरों की गुणवत्ता: उच्च 🟢
• उत्तर की गति: औसत 🟡

📊 <b>परीक्षण:</b>
• MMLU: 92.3%
• GPQA: 75.7%
• MGSM: 89.3%
• MATH: 96.4%
• HumanEval: 92.4%
• MMMU: 78.2%
• MathVista: 73.9%
"""
    INFO_CLAUDE = "🤖 <b>Claude मॉडल का चयन करें</b>, जिसके बारे में आप जानकारी प्राप्त करना चाहते हैं:"
    INFO_CLAUDE_3_HAIKU = f"""
<b>{Texts.CLAUDE_3_HAIKU}</b>

<b>निर्माता:</b> Anthropic

💡<b>उपयोग के विकल्प:</b>
• सामग्री निर्माण
• विचार निर्माण
• कॉपीराइटिंग
• संवाद और सहायता
• जटिल अवधारणाओं की व्याख्या
• प्रश्नों का उत्तर
• एक भाषा से दूसरी भाषा में अनुवाद
• अध्ययन में सहायता
• समस्याओं को हल करने में सहायता
• पाठ के साथ काम करना
• कोड के साथ काम करना
• सिफारिशें

🚦 <b>रेटिंग:</b>
• छवियों पर काम: नहीं 🔴
• उत्तरों की गुणवत्ता: औसत से ऊपर 🟢
• उत्तर की गति: तेज 🟢

📊 <b>परीक्षण:</b>
• MMLU: 80.9%
• GPQA: 41.6%
• DROP: 83.1%
• MGSM: 85.6%
• MATH: 69.2%
• HumanEval: 88.1%
"""
    INFO_CLAUDE_3_SONNET = f"""
<b>{Texts.CLAUDE_3_SONNET}</b>

<b>निर्माता:</b> Anthropic

💡<b>उपयोग के विकल्प:</b>
• सामग्री निर्माण
• विचार निर्माण
• कॉपीराइटिंग
• संवाद और सहायता
• जटिल अवधारणाओं की व्याख्या
• प्रश्नों का उत्तर
• एक भाषा से दूसरी भाषा में अनुवाद
• अध्ययन में सहायता
• समस्याओं को हल करने में सहायता
• पाठ के साथ काम करना
• कोड के साथ काम करना
• सिफारिशें

🚦 <b>रेटिंग:</b>
• छवियों पर काम: हां 🟢
• उत्तरों की गुणवत्ता: उच्च 🟢
• उत्तर की गति: औसत से तेज 🟢

📊 <b>परीक्षण:</b>
• MMLU: 90.5%
• GPQA: 65.0%
• DROP: 88.3%
• MGSM: 92.5%
• MATH: 78.3%
• HumanEval: 93.7%
• MMMU: 70.4%
• MathVista: 70.7%
"""
    INFO_CLAUDE_3_OPUS = f"""
<b>{Texts.CLAUDE_3_OPUS}</b>

<b>निर्माता:</b> Anthropic

💡<b>उपयोग के विकल्प:</b>
• सामग्री निर्माण
• विचार निर्माण
• कॉपीराइटिंग
• संवाद और सहायता
• जटिल अवधारणाओं की व्याख्या
• प्रश्नों का उत्तर
• एक भाषा से दूसरी भाषा में अनुवाद
• अध्ययन में सहायता
• समस्याओं को हल करने में सहायता
• पाठ के साथ काम करना
• कोड के साथ काम करना
• सिफारिशें

🚦 <b>रेटिंग:</b>
• छवियों पर काम: हां 🟢
• उत्तरों की गुणवत्ता: औसत से ऊपर 🟢
• उत्तर की गति: औसत 🟡

📊 <b>परीक्षण:</b>
• MMLU: 88.2%
• GPQA: 50.4%
• DROP: 83.1%
• MGSM: 90.7%
• MATH: 60.1%
• HumanEval: 84.9%
• MMMU: 59.4%
• MathVista: 50.5%
"""
    INFO_GEMINI = "🤖 <b>Gemini मॉडल का चयन करें</b>, जिसके बारे में आप जानकारी प्राप्त करना चाहते हैं:"
    INFO_GEMINI_2_FLASH = f"""
<b>{Texts.GEMINI_2_FLASH}</b>

<b>निर्माता:</b> Google

💡<b>उपयोग के विकल्प:</b>
• सामग्री निर्माण
• विचार निर्माण
• कॉपीराइटिंग
• संवाद और सहायता
• जटिल अवधारणाओं की व्याख्या
• प्रश्नों का उत्तर
• एक भाषा से दूसरी भाषा में अनुवाद
• अध्ययन में सहायता
• समस्याओं को हल करने में सहायता
• पाठ के साथ काम करना
• कोड के साथ काम करना
• सिफारिशें

🚦 <b>रेटिंग:</b>
• छवियों पर काम: हां 🟢
• उत्तरों की गुणवत्ता: औसत से ऊपर 🟢
• उत्तर की गति: उच्च 🟢

📊 <b>परीक्षण:</b>
• MMLU: 76.4%
• GPQA: 62.1%
• MATH: 89.7%
• MMMU: 70.7%
"""
    INFO_GEMINI_1_PRO = f"""
<b>{Texts.GEMINI_1_PRO}</b>

<b>निर्माता:</b> Google

💡<b>उपयोग के विकल्प:</b>
• सामग्री निर्माण
• विचार निर्माण
• कॉपीराइटिंग
• संवाद और सहायता
• जटिल अवधारणाओं की व्याख्या
• प्रश्नों का उत्तर
• एक भाषा से दूसरी भाषा में अनुवाद
• अध्ययन में सहायता
• समस्याओं को हल करने में सहायता
• पाठ के साथ काम करना
• कोड के साथ काम करना
• सिफारिशें

🚦 <b>रेटिंग:</b>
• छवियों पर काम: हां 🟢
• उत्तरों की गुणवत्ता: उच्च 🟢
• उत्तर की गति: औसत 🟡

📊 <b>परीक्षण:</b>
• MMLU: 75.8%
• GPQA: 59.1%
• MATH: 86.5%
• MMMU: 65.9%
"""
    INFO_GEMINI_1_ULTRA = f"""
<b>{Texts.GEMINI_1_ULTRA}</b>

<b>निर्माता:</b> Google

💡<b>उपयोग के विकल्प:</b>
• सामग्री निर्माण
• विचार निर्माण
• कॉपीराइटिंग
• संवाद और सहायता
• जटिल अवधारणाओं की व्याख्या
• प्रश्नों का उत्तर
• एक भाषा से दूसरी भाषा में अनुवाद
• अध्ययन में सहायता
• समस्याओं को हल करने में सहायता
• पाठ के साथ काम करना
• कोड के साथ काम करना
• सिफारिशें

🚦 <b>रेटिंग:</b>
• छवियों पर काम: हां 🟢
• उत्तरों की गुणवत्ता: उच्च 🟢
• उत्तर की गति: औसत 🟡

📊 <b>परीक्षण:</b>
• MMLU: 90.0%
• DROP: 82.4%
• HumanEval: 74.4%
• MATH: 53.2%
• MMMU: 59.4%
"""
    INFO_GROK = f"""
<b>{Texts.GROK}</b>

<b>निर्माता:</b> X (Twitter)

💡<b>उपयोग के विकल्प:</b>
• सामग्री निर्माण
• विचार निर्माण
• कॉपीराइटिंग
• संवाद और सहायता
• जटिल अवधारणाओं की व्याख्या
• प्रश्नों का उत्तर
• एक भाषा से दूसरी भाषा में अनुवाद
• अध्ययन में सहायता
• समस्याओं को हल करने में सहायता
• पाठ के साथ काम करना
• कोड के साथ काम करना
• सिफारिशें

🚦 <b>रेटिंग:</b>
• छवियों पर काम: हां 🟢
• उत्तरों की गुणवत्ता: उच्च 🟢
• उत्तर की गति: औसत से ऊपर 🟢

📊 <b>परीक्षण:</b>
• MMLU: 87.5%
• GPQA: 56.0%
• MATH: 76.1%
• HumanEval: 88.4%
• MMMU: 66.1%
• MathVista: 69.0%
"""
    INFO_DEEP_SEEK = "🤖 <b>DeepSeek मॉडल का चयन करें</b>, जिसके बारे में आप जानकारी प्राप्त करना चाहते हैं:"
    INFO_DEEP_SEEK_V3 = f"""
<b>{Texts.DEEP_SEEK_V3}</b>

<b>निर्माता:</b> DeepSeek

💡<b>उपयोग के विकल्प:</b>
• सामग्री निर्माण
• विचार निर्माण
• कॉपीराइटिंग
• संवाद और सहायता
• जटिल अवधारणाओं की व्याख्या
• प्रश्नों का उत्तर
• एक भाषा से दूसरी भाषा में अनुवाद
• अध्ययन में सहायता
• समस्याओं को हल करने में सहायता
• पाठ के साथ काम करना
• कोड के साथ काम करना
• सिफारिशें

🚦 <b>रेटिंग:</b>
• छवियों पर काम: नहीं 🔴
• उत्तरों की गुणवत्ता: औसत से ऊपर 🟢
• उत्तर की गति: उच्च 🟢

📊 <b>परीक्षण:</b>
• MMLU: 88.5%
• GPQA: 59.1%
• DROP: 91.6%
• MGSM: 79.8%
• MATH: 90.2%
• HumanEval: 82.6%
"""
    INFO_DEEP_SEEK_R1 = f"""
<b>{Texts.DEEP_SEEK}</b>

<b>निर्माता:</b> DeepSeek

💡<b>उपयोग के विकल्प:</b>
• सामग्री निर्माण
• जटिल अवधारणाओं की व्याख्या
• प्रश्नों का उत्तर
• एक भाषा से दूसरी भाषा में अनुवाद
• अध्ययन में सहायता
• समस्याओं को हल करने में सहायता
• पाठ के साथ काम करना
• कोड के साथ काम करना

🚦 <b>रेटिंग:</b>
• छवियों पर काम: नहीं 🔴
• उत्तरों की गुणवत्ता: उच्च 🟢
• उत्तर की गति: प्रतिक्रिया गति: औसत से कम 🟠

📊 <b>परीक्षण:</b>
• MMLU: 90.8%
• GPQA: 71.5%
• DROP: 92.2%
• MATH: 97.3%
"""
    INFO_PERPLEXITY = f"""
<b>{Texts.PERPLEXITY}</b>

💡<b>उपयोग के विकल्प:</b>
• वास्तविक समय में अद्यतन जानकारी की खोज
• हाल की घटनाओं पर आधारित प्रश्नों का उत्तर
• मौजूदा घटनाओं की निगरानी
• जानकारी की पुष्टि के लिए स्रोतों की खोज
• विभिन्न स्रोतों से डेटा की तुलना
• अद्यतन जानकारी के साथ शैक्षणिक लेख लिखने में सहायता
• शोध, रिपोर्ट और सांख्यिकी के लिंक खोजें
• शब्दों और अवधारणाओं की त्वरित व्याख्या
• साहित्यिक सूची तैयार करना
• शैक्षणिक सामग्री के लिए उदाहरण खोजना
• वर्तमान बाजार रुझानों का विश्लेषण
• प्रतियोगियों और उनके उत्पादों का पता लगाना
• कंपनी या उत्पाद के समीक्षाओं और उल्लेखों की निगरानी
• विज्ञापन अभियानों के लिए डेटा संग्रह
• खोज क्वेरी के आधार पर लक्ष्य दर्शकों की रुचियों का आकलन
• सामग्री के लिए विचार खोजना
• वास्तविक समय में विशिष्ट प्रश्नों के उत्तर देना

🚦 <b>रेटिंग:</b>
• छवियों पर काम: नहीं 🔴
• उत्तरों की गुणवत्ता: उच्च 🟢
• उत्तर की गति: औसत 🟡
"""
    INFO_DALL_E = f"""
<b>{Texts.DALL_E}</b>

• <i>आर्ट ऑन डिमांड</i>: विवरणों के आधार पर अद्वितीय छवियां उत्पन्न करना — इलस्ट्रेटर्स या प्रेरणा की खोज करने वालों के लिए आदर्श
• <i>विज्ञापन निर्माता</i>: विज्ञापन या सोशल मीडिया सामग्री के लिए आकर्षक छवियां बनाना
• <i>शैक्षणिक उपकरण</i>: शिक्षा में बेहतर समझ के लिए जटिल विचारों की दृश्य प्रस्तुति
• <i>आंतरिक सजावट</i>: कमरे की योजना और सजावट विषयों के लिए विचार प्राप्त करना
• <i>फैशन डिज़ाइन</i>: कपड़ों के डिज़ाइन या फैशन इलस्ट्रेशन बनाना
"""
    INFO_MIDJOURNEY = f"""
<b>{Texts.MIDJOURNEY}</b>

• <i>आर्ट डिज़ाइन</i>: विज़ुअल मास्टरपीस और अमूर्त कला बनाना, अनूठी शैली की खोज में कलाकारों और डिज़ाइनरों के लिए आदर्श
• <i>आर्किटेक्चरल मॉडलिंग</i>: भवनों और स्थानों की अवधारणात्मक परियोजनाएं बनाना
• <i>शैक्षणिक सहायक</i>: जटिल विषयों की समझ को बढ़ाने के लिए शिक्षण सामग्री के लिए इलस्ट्रेशन बनाना
• <i>आंतरिक डिज़ाइन</i>: पारंपरिक से आधुनिक प्रवृत्तियों तक के आंतरिक समाधान की दृश्य प्रस्तुति
• <i>फैशन और स्टाइल</i>: फैशनेबल लुक्स और एक्सेसरीज़ बनाना, रंगों और रूपों के साथ प्रयोग करना
"""
    INFO_STABLE_DIFFUSION = "🤖 <b>Stable Diffusion मॉडल चुनें</b>, जिसके बारे में आप जानकारी प्राप्त करना चाहते हैं:"
    INFO_STABLE_DIFFUSION_XL = f"""
<b>{Texts.STABLE_DIFFUSION_XL}</b>

• <i>रचनात्मक इलस्ट्रेशन</i>: पाठ आधारित अनुरोधों पर आधारित अद्वितीय छवियां उत्पन्न करना, कलाकारों, डिज़ाइनरों और लेखकों के लिए उपयुक्त
• <i>कॉन्सेप्ट आर्ट और स्केचिंग</i>: खेल, फिल्म और अन्य परियोजनाओं के लिए अवधारणात्मक छवियां बनाना, विचारों को विज़ुअलाइज़ करने में मदद करना
• <i>इमेज स्टाइलाइज़ेशन</i>: मौजूदा छवियों को विभिन्न कलात्मक शैलियों में बदलना, कॉमिक्स से लेकर क्लासिक चित्रशैली तक
• <i>डिज़ाइन प्रोटोटाइप</i>: लोगो, पोस्टर या वेब डिज़ाइन के लिए तेज़ दृश्य अवधारणाओं को उत्पन्न करना
• <i>कलात्मक शैलियों के साथ प्रयोग</i>: रंगों, रूपों और बनावटों के साथ नए विज़ुअल सॉल्यूशंस का विकास करना
"""
    INFO_STABLE_DIFFUSION_3 = f"""
<b>{Texts.STABLE_DIFFUSION_3}</b>

• <i>रचनात्मक इलस्ट्रेशन</i>: पाठ आधारित अनुरोधों पर आधारित अद्वितीय छवियां उत्पन्न करना, कलाकारों, डिज़ाइनरों और लेखकों के लिए उपयुक्त
• <i>कॉन्सेप्ट आर्ट और स्केचिंग</i>: खेल, फिल्म और अन्य परियोजनाओं के लिए अवधारणात्मक छवियां बनाना, विचारों को विज़ुअलाइज़ करने में मदद करना
• <i>इमेज स्टाइलाइज़ेशन</i>: मौजूदा छवियों को विभिन्न कलात्मक शैलियों में बदलना, कॉमिक्स से लेकर क्लासिक चित्रशैली तक
• <i>डिज़ाइन प्रोटोटाइप</i>: लोगो, पोस्टर या वेब डिज़ाइन के लिए तेज़ दृश्य अवधारणाओं को उत्पन्न करना
• <i>कलात्मक शैलियों के साथ प्रयोग</i>: रंगों, रूपों और बनावटों के साथ नए विज़ुअल सॉल्यूशंस का विकास करना
"""
    INFO_FLUX = "🤖 <b>Flux मॉडल चुनें</b>, जिसके बारे में आप जानकारी प्राप्त करना चाहते हैं:"
    INFO_FLUX_1_DEV = f"""
<b>{Texts.FLUX_1_DEV}</b>

• <i>अनंत वेरिएशन्स</i>: एक ही अनुरोध के आधार पर विभिन्न छवियां उत्पन्न करना, प्रत्येक परिणाम अद्वितीय
• <i>पैरामीटर का सटीक समायोजन</i>: छवि निर्माण प्रक्रिया को प्रबंधित करें, ताकि आपकी आवश्यकताओं के अनुसार परिणाम प्राप्त हो सके
• <i>रैंडमनेस के तत्व के साथ जनरेशन</i>: अप्रत्याशित रूप से रचनात्मक समाधान बनाने के लिए रैंडम तत्व जोड़ें
• <i>विज़ुअल अवधारणाओं की विविधता</i>: विभिन्न कलात्मक शैलियों और दृष्टिकोणों का अन्वेषण करें, प्रक्रिया को अपनी ज़रूरतों के अनुसार अनुकूलित करें
• <i>तेज़ विज़ुअल प्रयोग</i>: विभिन्न अवधारणाओं और शैलियों को बिना सीमाओं के आज़माने का अवसर, रचनात्मकता के नए आयाम खोलते हुए
"""
    INFO_FLUX_1_PRO = f"""
<b>{Texts.FLUX_1_PRO}</b>

• <i>अनंत वेरिएशन्स</i>: एक ही अनुरोध के आधार पर विभिन्न छवियां उत्पन्न करना, प्रत्येक परिणाम अद्वितीय
• <i>पैरामीटर का सटीक समायोजन</i>: छवि निर्माण प्रक्रिया को प्रबंधित करें, ताकि आपकी आवश्यकताओं के अनुसार परिणाम प्राप्त हो सके
• <i>रैंडमनेस के तत्व के साथ जनरेशन</i>: अप्रत्याशित रूप से रचनात्मक समाधान बनाने के लिए रैंडम तत्व जोड़ें
• <i>विज़ुअल अवधारणाओं की विविधता</i>: विभिन्न कलात्मक शैलियों और दृष्टिकोणों का अन्वेषण करें, प्रक्रिया को अपनी ज़रूरतों के अनुसार अनुकूलित करें
• <i>तेज़ विज़ुअल प्रयोग</i>: विभिन्न अवधारणाओं और शैलियों को बिना सीमाओं के आज़माने का अवसर, रचनात्मकता के नए आयाम खोलते हुए
"""
    INFO_LUMA_PHOTON = f"""
<b>{Texts.LUMA_PHOTON}</b>

• <i>फोटो-यथार्थवादी छवियां</i>: आर्किटेक्चर, डिज़ाइन और मार्केटिंग के लिए उच्च गुणवत्ता वाली दृश्य प्रस्तुति बनाना
• <i>त्रि-आयामी मॉडलिंग</i>: 3D अवधारणाओं और दृश्य प्रस्तुति उत्पन्न करना, प्रेजेंटेशन और प्रोजेक्ट्स के लिए आदर्श
• <i>प्रकाश प्रभाव और बनावट</i>: यथार्थवादी छवियों के लिए जटिल प्रकाश प्रभाव और बनावट प्रबंधित करना
• <i>रचनात्मक रेंडरिंग</i>: अनूठी कलात्मक दृश्य प्रस्तुतियों के लिए रचनात्मक शैली और संरचनाओं के साथ प्रयोग करना
• <i>कार्य में दक्षता</i>: उन पेशेवरों के लिए आदर्श, जो प्रोजेक्ट्स के लिए तेज़ और गुणवत्तापूर्ण परिणाम चाहते हैं
"""
    INFO_RECRAFT = f"""
<b>{Texts.RECRAFT}</b>

• <i>फोटो-यथार्थवादी छवियां</i>: वास्तुकला, डिज़ाइन और मार्केटिंग के लिए विस्तृत छवियां बनाना
• <i>बनावट पर काम</i>: जटिल बनावट जोड़ें और दृश्य प्रभाव को बढ़ाने के लिए यथार्थवादी सतहें बनाएं
• <i>शैलीबद्ध दृश्य प्रस्तुतियां</i>: अद्वितीय कलात्मक शैलियों और संरचनाओं के साथ प्रयोग करें
• <i>तेज़ रेंडरिंग गति</i>: बिना गुणवत्ता खोए तेज़ छवि निर्माण
• <i>उपयोग में सरलता</i>: उन डिज़ाइनरों, कलाकारों और पेशेवरों के लिए उपयुक्त जो समय बचाना चाहते हैं
"""
    INFO_FACE_SWAP = f"""
<b>{Texts.FACE_SWAP}</b>

• <i>मज़ेदार पुनर्व्याख्या</i>: देखें कि आप विभिन्न ऐतिहासिक युगों या विभिन्न फिल्म पात्रों के रूप में कैसे दिखते
• <i>निजीकृत बधाई</i>: निजीकृत छवियों के साथ अनूठे कार्ड या निमंत्रण बनाएं
• <i>मीम्स और सामग्री निर्माण</i>: अपने सोशल मीडिया को मज़ेदार या कल्पनात्मक तस्वीरों से जीवंत करें
• <i>डिजिटल मेकअप</i>: नए हेयरस्टाइल्स या मेकअप शैलियों के साथ प्रयोग करें
• <i>सेलिब्रिटीज़ के साथ मिश्रण</i>: मशहूर हस्तियों के साथ अपना चेहरा मिलाएं और मज़ेदार तुलना करें
"""
    INFO_PHOTOSHOP_AI = f"""
<b>{Texts.PHOTOSHOP_AI}</b>

• <i>गुणवत्ता में सुधार</i>: छवि का रिज़ॉल्यूशन बढ़ाएं, स्पष्टता में सुधार करें और शोर को कम करें, जिससे छवि अधिक विस्तृत और चमकदार बने
• <i>फोटो बहाली</i>: पुरानी या क्षतिग्रस्त तस्वीरों को बहाल करें, उन्हें उनकी मूल स्थिति में वापस लाएं
• <i>काले और सफेद से रंगीन में बदलना</i>: काले और सफेद तस्वीरों को जीवंत और प्राकृतिक रंगों के साथ पुनर्जीवित करें
• <i>पृष्ठभूमि हटाना</i>: छवियों से पृष्ठभूमि को आसानी से हटा दें, केवल मुख्य ऑब्जेक्ट को रखते हुए
"""
    INFO_MUSIC_GEN = f"""
<b>{Texts.MUSIC_GEN}</b>

• <i>अद्वितीय धुनों की रचना</i>: आपकी विचारों को किसी भी शैली में संगीत में बदलना — शास्त्रीय संगीत से लेकर पॉप संगीत तक
• <i>व्यक्तिगत ध्वनि पथ</i>: अपने अगले वीडियो प्रोजेक्ट, गेम या प्रेजेंटेशन के लिए ध्वनि पथ तैयार करें
• <i>संगीत शैलियों का अन्वेषण</i>: विभिन्न संगीत शैलियों और ध्वनियों के साथ प्रयोग करें, ताकि आप अपनी अनूठी शैली खोज सकें
• <i>शिक्षा और प्रेरणा</i>: संगीत सिद्धांत और शैलियों के इतिहास के बारे में जानें और संगीत बनाकर प्रेरित हों
• <i>तुरंत धुन निर्माण</i>: बस एक पाठ विवरण या मूड दर्ज करें, और MusicGen उसे तुरंत संगीत में बदल देगा
"""
    INFO_SUNO = f"""
<b>{Texts.SUNO}</b>

• <i>पाठ को गीत में बदलना</i>: Suno आपके लिखे हुए पाठ को गाने में बदलता है, आपकी शैली के अनुसार मेलोडी और ताल तैयार करता है
• <i>व्यक्तिगत गाने</i>: खास मौकों के लिए अनूठे गाने तैयार करें, चाहे वह व्यक्तिगत उपहार हो या आपके कार्यक्रम के लिए ध्वनि पथ
• <i>संगीत शैली की विविधता का अन्वेषण</i>: नई संगीत क्षितिजों की खोज करें, विभिन्न शैलियों और ध्वनियों के साथ प्रयोग करें
• <i>संगीत शिक्षा और प्रेरणा</i>: संगीत सिद्धांत और शैलियों के इतिहास के बारे में व्यावहारिक रूप से जानें
• <i>तेज़ संगीत निर्माण</i>: अपनी भावनाओं या दृश्य को वर्णित करें, और Suno उसे तुरंत गीत में बदल देगा
"""
    INFO_KLING = f"""
<b>{Texts.KLING}</b>

• <i>विवरण के आधार पर वीडियो निर्माण</i>: अपनी विचारों का वर्णन करें, और Kling एक प्रभावशाली वीडियो क्लिप तैयार करेगा
• <i>अद्वितीय शैलियों के साथ काम</i>: अपनी वीडियो की व्यक्तिगतता को उजागर करने के लिए विभिन्न शैलियों का उपयोग करें
• <i>डायनामिक ट्रांज़िशन्स</i>: दृश्यों के बीच सहज और प्रभावशाली ट्रांज़िशन्स को स्वतः जोड़ें
• <i>रचनात्मक दृश्य प्रभाव</i>: अपने प्रोजेक्ट्स के लिए आधुनिक प्रभावों के साथ वीडियो तैयार करें
• <i>कुछ ही मिनटों में सामग्री</i>: पेशेवर वीडियो क्लिप्स बिना एडिटिंग कौशल की आवश्यकता के तैयार करें
"""
    INFO_RUNWAY = f"""
<b>{Texts.RUNWAY}</b>

• <i>संक्षिप्त वीडियो क्लिप्स तैयार करना</i>: विचार या स्क्रिप्ट का वर्णन करें, एक फोटो जोड़ें, और Runway एक अनूठा वीडियो बनाएगा
• <i>फोटो + टेक्स्ट से वीडियो निर्माण</i>: चित्र और पाठ विवरण को गतिशील वीडियो में बदलें
• <i>एनिमेशन और दृश्य प्रभाव</i>: अपनी विचारों के आधार पर रचनात्मक और आकर्षक एनिमेशन बनाएं
• <i>सोशल मीडिया के लिए AI सामग्री</i>: प्लेटफ़ॉर्म और प्रोजेक्ट्स के लिए तुरंत आकर्षक वीडियो तैयार करें
• <i>वीडियो फॉर्मेट्स के साथ प्रयोग</i>: नई शैलियों और वीडियो सामग्री बनाने के लिए AI की क्षमताओं का अन्वेषण करें
"""
    INFO_LUMA_RAY = f"""
<b>{Texts.LUMA_RAY}</b>

• <i>उच्च गुणवत्ता वाले वीडियो</i>: विवरण के आधार पर यथार्थवादी और गतिशील वीडियो तैयार करना
• <i>3D एनिमेशन</i>: आपके प्रोजेक्ट्स के लिए प्रभावशाली त्रिआयामी एनिमेशन निर्माण
• <i>सिनेमाई शैली</i>: पेशेवर फिल्म के लिए प्रभावों और कम्पोज़िशन का उपयोग
• <i>दृश्य जादू</i>: गुणवत्तापूर्ण सामग्री निर्माण के लिए नवीनतम तकनीकों का उपयोग करें
• <i>नए वीडियो फॉर्मेट्स</i>: नई शैलियों और दृष्टिकोणों के साथ वीडियो सामग्री निर्माण में प्रयोग करें
"""
    INFO_PIKA = f"""
<b>{Texts.PIKA}</b>

• <i>वीडियो निर्माण</i>: अपनी विचार का वर्णन करें, और Pika कुछ ही मिनटों में एक अनूठा वीडियो बनाएगा
• <i>वीडियो स्टाइलिंग</i>: अपने वीडियो को मूल और यादगार बनाने के लिए कलात्मक शैलियों का उपयोग करें
• <i>एनिमेशन जोड़ना</i>: स्थिर तत्वों को गतिशील दृश्यों में बदलें
• <i>इंटरेक्टिव सामग्री</i>: ऐसी वीडियो बनाएं जो दर्शकों का ध्यान खींचें और उन्हें संलग्न करें
• <i>सहज सामग्री</i>: आसानी से पेशेवर वीडियो तैयार करें, चाहे आप नौसिखिया हों
"""

    # Kling
    KLING_MODE_STANDARD = "🔸 मानक"
    KLING_MODE_PRO = "🔹 प्रो"

    # Language
    LANGUAGE = "भाषा:"
    LANGUAGE_CHOSEN = "चुनी गई भाषा: हिंदी 🇮🇳"

    # Maintenance Mode
    MAINTENANCE_MODE = "🤖 मैं रखरखाव मोड में हूँ। कृपया थोड़ी देर प्रतीक्षा करें 🛠"

    # Midjourney
    MIDJOURNEY_ALREADY_CHOSE_UPSCALE = "आपने पहले ही इस चित्र का चयन किया है, कृपया एक नया आज़माएँ 🙂"

    # Model
    MODEL = "यदि आप <b>मॉडल बदलना</b> चाहते हैं, तो नीचे दिए गए बटन पर क्लिक करें 👇"
    MODEL_CHANGE_AI = "🤖 AI मॉडल बदलें"
    MODEL_CHOOSE_CHAT_GPT = "<b>ChatGPT 💭</b> मॉडल चुनने के लिए नीचे दिए गए बटन पर क्लिक करें 👇"
    MODEL_CHOOSE_CLAUDE = "<b>Claude 📄</b> मॉडल चुनने के लिए नीचे दिए गए बटन पर क्लिक करें 👇"
    MODEL_CHOOSE_GEMINI = "<b>Gemini ✨</b> मॉडल चुनने के लिए नीचे दिए गए बटन पर क्लिक करें 👇"
    MODEL_CHOOSE_DEEP_SEEK = "<b>DeepSeek 🐳</b> मॉडल चुनने के लिए नीचे दिए गए बटन पर क्लिक करें 👇"
    MODEL_CHOOSE_STABLE_DIFFUSION = "<b>Stable Diffusion 🎆</b> मॉडल चुनने के लिए नीचे दिए गए बटन पर क्लिक करें 👇"
    MODEL_CHOOSE_FLUX = "<b>Flux 🫐</b> मॉडल चुनने के लिए नीचे दिए गए बटन पर क्लिक करें 👇"
    MODEL_CONTINUE_GENERATING = "जेनरेशन जारी रखें"
    MODEL_ALREADY_MAKE_REQUEST = "⚠️ आपने पहले ही एक अनुरोध किया है। कृपया प्रतीक्षा करें"
    MODEL_READY_FOR_NEW_REQUEST = "😌 आप अगला अनुरोध कर सकते हैं"
    MODEL_SHOW_QUOTA = "🔄 सदस्यता की सीमाएँ दिखाएँ"
    MODEL_SWITCHED_TO_AI_MANAGE = "⚙️ प्रबंधन"
    MODEL_SWITCHED_TO_AI_MANAGE_INFO = "मॉडल के साथ क्या करना चाहते हैं, चुनें:"
    MODEL_SWITCHED_TO_AI_SETTINGS = "🛠️ सेटिंग्स पर जाएं"
    MODEL_SWITCHED_TO_AI_INFO = "ℹ️ अधिक जानकारी प्राप्त करें"
    MODEL_SWITCHED_TO_AI_EXAMPLES = "💡 अनुरोध के उदाहरण दिखाएं"
    MODEL_ALREADY_SWITCHED_TO_THIS_MODEL = """
🔄 <b>सब कुछ वैसा ही रहा!</b>

आपने वही मॉडल चुना है, जो आपके पास पहले से है
"""

    @staticmethod
    def model_switched(model_name: str, model_type: ModelType, model_info: dict):
        if model_type == ModelType.TEXT:
            model_role = model_info.get('role').split(' ')
            model_role = ' '.join(model_role[1:] + [model_role[0]])
            facts = f"""<b>तथ्य और सेटिंग्स:</b>
📅 जानकारी उपलब्धता: {model_info.get('training_data')}
📷 फोटो के साथ काम: {'हां ✅' if model_info.get('support_photos', False) else 'नहीं ❌'}
{Hindi.VOICE_MESSAGES}: {'चालू ✅' if model_info.get(UserSettings.TURN_ON_VOICE_MESSAGES, False) else 'बंद ❌'}
🎭 भूमिका: {model_role}"""
        elif model_type == ModelType.SUMMARY:
            model_focus = model_info.get(UserSettings.FOCUS, VideoSummaryFocus.INSIGHTFUL)
            if model_focus == VideoSummaryFocus.INSIGHTFUL:
                model_focus = ' '.join(reversed(Hindi.VIDEO_SUMMARY_FOCUS_INSIGHTFUL.split(' ', 1)))
            elif model_focus == VideoSummaryFocus.FUNNY:
                model_focus = ' '.join(reversed(Hindi.VIDEO_SUMMARY_FOCUS_FUNNY.split(' ', 1)))
            elif model_focus == VideoSummaryFocus.ACTIONABLE:
                model_focus = ' '.join(reversed(Hindi.VIDEO_SUMMARY_FOCUS_ACTIONABLE.split(' ', 1)))
            elif model_focus == VideoSummaryFocus.CONTROVERSIAL:
                model_focus = ' '.join(reversed(Hindi.VIDEO_SUMMARY_FOCUS_CONTROVERSIAL.split(' ', 1)))

            model_format = model_info.get(UserSettings.FORMAT, VideoSummaryFormat.LIST)
            if model_format == VideoSummaryFormat.LIST:
                model_format = ' '.join(reversed(Hindi.VIDEO_SUMMARY_FORMAT_LIST.split(' ', 1)))
            elif model_format == VideoSummaryFormat.FAQ:
                model_format = ' '.join(reversed(Hindi.VIDEO_SUMMARY_FORMAT_FAQ.split(' ', 1)))

            model_amount = model_info.get(UserSettings.AMOUNT, VideoSummaryAmount.AUTO)
            if model_amount == VideoSummaryAmount.AUTO:
                model_amount = ' '.join(reversed(Hindi.VIDEO_SUMMARY_AMOUNT_AUTO.split(' ', 1)))
            elif model_amount == VideoSummaryAmount.SHORT:
                model_amount = ' '.join(reversed(Hindi.VIDEO_SUMMARY_AMOUNT_SHORT.split(' ', 1)))
            elif model_amount == VideoSummaryAmount.DETAILED:
                model_amount = ' '.join(reversed(Hindi.VIDEO_SUMMARY_AMOUNT_DETAILED.split(' ', 1)))

            facts = f"""<b>तथ्य और सेटिंग्स:</b>
{Hindi.SETTINGS_FOCUS}: {model_focus}
{Hindi.SETTINGS_FORMAT}: {model_format}
{Hindi.SETTINGS_AMOUNT}: {model_amount}
{Hindi.VOICE_MESSAGES}: {'चालू ✅' if model_info.get(UserSettings.TURN_ON_VOICE_MESSAGES, False) else 'बंद ❌'}"""
        elif model_type == ModelType.IMAGE:
            #     SETTINGS_SEND_TYPE_IMAGE = "छवि 🖼"
            #     SETTINGS_SEND_TYPE_DOCUMENT = "दस्तावेज़ 📄"
            #     SETTINGS_SEND_TYPE_AUDIO = "ऑडियो 🎤"
            #     SETTINGS_SEND_TYPE_VIDEO = "वीडियो 📺"
            model_version = get_model_version(model_info)
            model_version_info = f'\n{Hindi.SETTINGS_VERSION}: {model_version}' if model_version else ''
            facts = f"""<b>तथ्य और सेटिंग्स:</b>{model_version_info}
📷 फोटो के साथ काम: {'हां ✅' if model_info.get('support_photos', False) else 'नहीं ❌'}
{Hindi.SETTINGS_ASPECT_RATIO}: {'स्वनिर्धारित' if model_info.get(UserSettings.ASPECT_RATIO, AspectRatio.CUSTOM) == AspectRatio.CUSTOM else model_info.get(UserSettings.ASPECT_RATIO)}
{Hindi.SETTINGS_SEND_TYPE}: {'दस्तावेज़ 📄' if model_info.get(UserSettings.SEND_TYPE, SendType.IMAGE) == SendType.DOCUMENT else 'छवि 🖼'}"""
        elif model_type == ModelType.MUSIC:
            model_version = get_model_version(model_info)
            model_version_info = f'\n{Hindi.SETTINGS_VERSION}: {model_version}' if model_version else ''
            facts = f"""<b>तथ्य और सेटिंग्स:</b>{model_version_info}
{Hindi.SETTINGS_SEND_TYPE}: {'वीडियो 📺' if model_info.get(UserSettings.SEND_TYPE, SendType.AUDIO) == SendType.VIDEO else 'ऑडियो 🎤'}"""
        elif model_type == ModelType.VIDEO:
            model_version = get_model_version(model_info)
            model_version_info = f'\n{Hindi.SETTINGS_VERSION}: {model_version}' if model_version else ''
            facts = f"""<b>तथ्य और सेटिंग्स:</b>{model_version_info}
📷 फोटो के साथ काम: {'हां ✅' if model_info.get('support_photos', False) else 'नहीं ❌'}
{Hindi.SETTINGS_ASPECT_RATIO}: {'स्वनिर्धारित' if model_info.get(UserSettings.ASPECT_RATIO, AspectRatio.CUSTOM) == AspectRatio.CUSTOM else model_info.get(UserSettings.ASPECT_RATIO)}
{Hindi.SETTINGS_DURATION}: {model_info.get(UserSettings.DURATION, 5)} सेकंड
{Hindi.SETTINGS_SEND_TYPE}: {'दस्तावेज़ 📄' if model_info.get(UserSettings.SEND_TYPE, SendType.VIDEO) == SendType.DOCUMENT else 'वीडियो 📺'}"""
        else:
            facts = f"<b>तथ्य और सेटिंग्स:</b> जल्द ही 🔜"

        return f"""
<b>{model_name}</b>
👆 <b>चुना हुआ मॉडल</b>

{facts}

<b>सेटिंग्स पर जाने के लिए</b>, <b>मॉडल के बारे में अधिक जानकारी प्राप्त करने के लिए</b>, और <b>प्रश्नों के उदाहरण देखने के लिए</b>, नीचे दिए गए बटन पर क्लिक करें 👇
"""

    @staticmethod
    def model_text_processing_request() -> str:
        texts = [
            "अभी अपने डिजिटल क्रिस्टल बॉल से परामर्श कर रहा हूँ, ताकि सबसे अच्छा उत्तर ढूंढ सकूं... 🔮",
            "एक मिनट रुकें, अपने छोटे AI हम्सटर को उत्तर तैयार करने के लिए प्रशिक्षित कर रहा हूँ... 🐹",
            "अपनी डिजिटल लाइब्रेरी में सही उत्तर की तलाश कर रहा हूँ। थोड़ा धैर्य रखें... 📚",
            "जरा रुके, मैं अपने आंतरिक AI गुरु को आपके उत्तर के लिए बुला रहा हूँ... 🧘",
            "इंटरनेट के देवताओं से परामर्श कर रहा हूँ, कृपया थोड़ा इंतजार करें... 👾",
            "ज्ञान के खजाने को एकत्रित कर रहा हूँ... या कम से कम जो मैं इंटरनेट पर पा सकूं... 🌐",
            "एक सेकंड, अपनी सोच वाली टोपी पहन रहा हूँ... हाँ, अब बेहतर है। चलिए देखते हैं... 🎩",
            "अपनी डिजिटल आस्तीन ऊपर चढ़ा कर काम पर लग रहा हूँ। आपका उत्तर जल्द ही तैयार होगा... 💪",
            "पूर्ण शक्ति पर काम कर रहा हूँ! मेरे AI गियर्स उत्तर तैयार करने के लिए घूम रहे हैं... 🚂",
            "डेटा के समुद्र में गोता लगाकर, आपके उत्तर को ढूंढ रहा हूँ। थोड़ी देर में लौटता हूँ... 🎣",
            "अपने वर्चुअल एल्फ से परामर्श कर रहा हूँ। ये अक्सर बहुत अच्छे उत्तर खोजते हैं... 🧝",
            "उत्तर को तेज़ी से खोजने के लिए हाइपरस्पीड मोड चालू कर रहा हूँ। कृपया थोड़ा रुकें... 🚀",
            "रसोई में जाकर उत्तर की ताज़ा कड़ी तैयार कर रहा हूँ। यह स्वादिष्ट होगा... 🍳",
            "एक तेज़ दौरे पर क्लाउड तक जा रहा हूँ और वापस। उम्मीद है, कुछ स्मार्ट जानकारी लाऊँगा... ☁️",
            "आपके प्रश्न को मेरे डिजिटल गार्डन में लगा रहा हूँ। देखते हैं, क्या फलता है... 🌱",
            "अपने डिजिटल मसल्स को मजबूत कर रहा हूँ, ताकि शक्तिशाली उत्तर दे सकूं... 💪",
            "विज़्ज़! उत्तर की गणना शुरू हो चुकी है। यह जल्द ही तैयार होगा... 🪄",
            "मेरे डिजिटल उल्लू ज्ञान की तलाश में उड़ान भर चुके हैं। जल्द ही उत्तर लाएँगे... 🦉",
            "साइबरस्पेस में आइडियाज की आँधी है, उत्तर पाने के लिए बिजली पकड़ रहा हूँ... ⚡",
            "मेरी डिजिटल रैकून टीम सही उत्तर की खोज कर रही है। इसमें ये माहिर हैं... 🦝",
            "सबसे कीमती जानकारी खोजने के लिए गिलहरी की तरह डेटा छाँट रहा हूँ... 🐿️",
            "अपनी डिजिटल कोट पहनकर उत्तर की खोज पर निकल रहा हूँ... 🕵️‍♂️",
            "स्पेस से नए आइडियाज का पैकेट डाउनलोड कर रहा हूँ। उत्तर जल्द ही उतरेगा... 🚀",
            "डेटा के वर्चुअल टेबल पर कार्ड फैला रहा हूँ। सटीक <s>भविष्यवाणी</s> उत्तर तैयार कर रहा हूँ... 🃏",
            "मेरे वर्चुअल जहाज जानकारी के समुद्र में निकल चुके हैं। उत्तर जल्द ही आएगा... 🚢",
        ]

        return random.choice(texts)

    @staticmethod
    def model_image_processing_request() -> str:
        texts = [
            "तारों की धूल जमा कर रहा हूँ आपके खगोलीय कृति के लिए... 🌌",
            "डिजिटल रंगों की पैलेट मिलाकर आपके मास्टरपीस को तैयार कर रहा हूँ... 🎨",
            "वर्चुअल स्याही में डुबकी लगाकर आपकी कल्पना को उकेर रहा हूँ... 🖌️",
            "प्रेरणादायक चित्र के लिए AI म्यूज को बुला रहा हूँ... 🌠",
            "पिक्सेल्स को परिपूर्णता तक ले जा रहा हूँ, एक क्षण रुकें... 🎭",
            "आपकी आँखों के लिए दृश्य दावत तैयार कर रहा हूँ... 🍽️",
            "डिजिटल दा विंची से आपके कलात्मक अनुरोध पर परामर्श कर रहा हूँ... 🎭",
            "आपके रचनात्मक अनुरोध के लिए डिजिटल कैनवास को साफ कर रहा हूँ... 🖼️",
            "AI के कड़ाही में दृश्य मंत्र गढ़ रहा हूँ... 🔮",
            "वर्चुअल कैनवास को सक्रिय कर रहा हूँ। कला के लिए तैयार हो जाइए... 🖼️",
            "आपके विचारों को पिक्सल गैलरी में बदल रहा हूँ... 👨‍🎨",
            "डिजिटल सफारी पर जा रहा हूँ, ताकि आपकी कलात्मक दृष्टि को कैद कर सकूं... 🦁",
            "AI कला इंजन को चालू कर रहा हूँ, कृपया प्रतीक्षा करें... 🏎️",
            "डिजिटल कल्पना के स्विमिंग पूल में डुबकी लगा रहा हूँ... 🏊‍",
            "AI की रसोई में दृश्य सिम्फनी तैयार कर रहा हूँ... 🍳",
            "आपकी दृश्य कृति बनाने के लिए रचनात्मक बादलों को जमा कर रहा हूँ... ☁️",
            "डिजिटल ब्रश और रंग जमा कर रहा हूँ, ताकि आपकी कल्पना को जीवंत बना सकूं... 🎨",
            "महाकाव्य चित्र बनाने के लिए पिक्सेल ड्रेगन को बुला रहा हूँ... 🐉",
            "आपके दृश्य पुष्पन के लिए अमृत एकत्र करने के लिए डिजिटल मधुमक्खियों को बुला रहा हूँ... 🐝",
            "अपनी डिजिटल कलाकार की टोपी पहनकर आपके मास्टरपीस पर काम शुरू कर रहा हूँ... 👒",
            "पिक्सेल्स को जादुई घोल में डुबोकर उन्हें मास्टरपीस में चमका रहा हूँ... 🧪",
            "कल्पना की मिट्टी से आपका चित्र गढ़ रहा हूँ, जल्द ही यह कृति तैयार होगी... 🏺",
            "मेरे वर्चुअल एल्प्स पहले से ही आपका चित्र बना रहे हैं... 🧝‍♂️",
            "वर्चुअल कछुए आपके चित्र को डेटा के समुद्र के पार ले जा रहे हैं... 🐢",
            "वर्चुअल बिल्ली के बच्चे पहले से ही अपने पंजों से आपकी कृति बना रहे हैं... 🐱",
        ]

        text = random.choice(texts)
        text += "\n\n⚠️ <i>जनरेशन में 3 मिनट तक का समय लग सकता है</i>"

        return text

    @staticmethod
    def model_face_swap_processing_request() -> str:
        texts = [
            "चेहरे बदलने के आयाम में प्रवेश कर रहा हूँ... 👤",
            "डिजिटल पिकासो की तरह चेहरे मिला रहा हूँ... 🧑‍🎨",
            "चेहरे बदल रहा हूँ, जैसे गिरगिट अपने रंग बदलता है... 🦎",
            "चेहरे मिलाने की जादूई प्रक्रिया शुरू कर रहा हूँ... ✨",
            "चेहरों की रसायनशास्त्र कर रहा हूँ, पहचान बदल रहा हूँ... 🧬",
            "चेहरे बदलने की मशीन चालू कर रहा हूँ... 🤖",
            "चेहरे के रूपांतरण का अमृत तैयार कर रहा हूँ... 👩‍🔬",
            "चेहरों के जादुई दुनिया में मंत्रमुग्ध हो रहा हूँ... 🧚‍",
            "चेहरे के गुणों की संगति बना रहा हूँ... 🎼",
            "डिजिटल कला-स्टूडियो में नए चेहरे बना रहा हूँ... 🎨",
            "चेहरे बदलने के जादू का काढ़ा तैयार कर रहा हूँ... 🔮",
            "महान वास्तुकार की तरह चेहरे गढ़ रहा हूँ... 🏗️",
            "आदर्श चेहरों के मेल की खोज शुरू कर रहा हूँ... 🔍",
            "चेहरे बदलने के रोमांचक सफर की रॉकेट लॉन्च कर रहा हूँ... 🚀",
            "चेहरों को बदलने के लिए आकाशगंगा यात्रा पर निकल रहा हूँ... 👽",
        ]

        text = random.choice(texts)
        text += "\n\n⚠️ <i>जनरेशन में 5 मिनट तक का समय लग सकता है</i>"

        return text

    @staticmethod
    def model_music_processing_request() -> str:
        texts = [
            "संगीत जनरेटर चालू कर रहा हूँ, कान तैयार रखें... 👂",
            "नोट्स को डीजे की तरह मिला रहा हूँ... 🕺",
            "संगीत जादूगर अपने काम पर है, जादू के लिए तैयार हो जाएं... 🧙‍",
            "ऐसा संगीत बना रहा हूँ, जो रोबोट को भी नाचने पर मजबूर कर दे... 💃",
            "संगीत की प्रयोगशाला सक्रिय है, गर्माहट महसूस होगी... 🔥",
            "प्रेरणा की लहर पकड़कर उसे सुरों में बदल रहा हूँ... 🌊",
            "संगीत की ऊँचाइयों पर चढ़ रहा हूँ, थोड़ी देर रुके रहें... 🏔️",
            "ऐसा कुछ बना रहा हूँ, जिसे कानों ने पहले कभी नहीं सुना... 👂",
            "ताल और सुरों के सागर में गोता लगा रहा हूँ... 🌊",
            "उस दरवाजे को खोल रहा हूँ, जहाँ संगीत वास्तविकता बनाता है... 🌍",
            "संगीत की रचना के कोड तोड़ रहा हूँ, कुछ अनोखा बनाने के लिए... 🎶",
            "संगीत की रचना ऐसे कर रहा हूँ जैसे कोई शेफ अपने व्यंजन... 🍽️",
            "क्लेविशों पर पार्टी आयोजित कर रहा हूँ, हर सुर एक मेहमान है... 🎹",
            "संगीतिक भूलभुलैया में रास्ता बना रहा हूँ... 🌀",
            "हवा की तरंगों को जादुई सुरों में बदल रहा हूँ... 🌬️",
        ]

        text = random.choice(texts)
        text += "\n\n⚠️ <i>जनरेशन में 10 मिनट तक का समय लग सकता है</i>"

        return text

    @staticmethod
    def model_video_processing_request() -> str:
        texts = [
            "वीडियो प्रीमियर तैयार हो रहा है, लगभग पूरा... 🍿",
            "वीडियो क्रिएटिविटी रॉकेट लॉन्च हो रही है! सीट बेल्ट बांध लें... 🚀",
            "फ्रेम्स जीवंत हो रहे हैं, कैमरा, एक्शन... 🎬",
            "शॉट दर शॉट एक मास्टरपीस तैयार कर रहा हूँ... 🎥",
            "यह सिर्फ वीडियो नहीं, एक सिनेमेटिक चमत्कार है... 🎞️",
            "आपके WOW के लिए सर्वश्रेष्ठ फ्रेम्स से एक पज़ल तैयार कर रहा हूँ... 🤩",
            "पिक्सल्स को जोड़ रहा हूँ — तैयार हो जाएं एक वीडियो मास्टरपीस के लिए... 🎇",
            "सबसे अच्छे फ्रेम्स पकड़ रहा हूँ, शेड्यूल बन रहा है... 🎣",
            "एडिटिंग टेबल पर धूम मची है, आपका वीडियो मास्टरपीस बन रहा है... 🔥",
            "आपके आयाम में वीडियो सामग्री अपलोड कर रहा हूँ... 🎞️",
            "AI मधुमक्खियां आपके वीडियो शहद पर काम कर रही हैं... तैयार रहें मीठे नतीजों के लिए... 🐝",
            "जादुई प्रोजेक्टर लॉन्च हो रहा है... ✨",
            "पिज्जा ओवन में बन रहा है... ओह नहीं, आपका वीडियो... 🍕",
            "मैं विजुअल जादू कर रहा हूँ, वीडियो जादुई होगा... 🎩",
            "आपके वीडियो को क्रिएटिविटी के रेलमार्ग पर ला रहा हूँ... 🚉",
        ]

        text = random.choice(texts)
        text += "\n\n⚠️ <i>जनरेशन में 20 मिनट तक का समय लग सकता है</i>"

        return text

    @staticmethod
    def model_wait_for_another_request(seconds: int) -> str:
        return f"⏳ कृपया अगले अनुरोध को भेजने से पहले {seconds} सेकंड तक प्रतीक्षा करें"

    @staticmethod
    def model_reached_usage_limit():
        hours, minutes = get_time_until_limit_update()

        return f"""
🚨 <b>आपने वर्तमान उपयोग सीमा को पूरा कर लिया है</b>

दैनिक सीमा <i>{hours} घंटा {minutes} मिनट</i> में रीसेट हो जाएगी 🔄

यदि आप इंतजार नहीं करना चाहते हैं, तो मेरे पास कुछ समाधान हैं:
"""

    @staticmethod
    def model_restricted(model: str):
        return f"""
🔒 <b>आपने VIP ज़ोन में प्रवेश किया है!</b>

{model} आपकी वर्तमान सदस्यता में शामिल नहीं है

कोई कार्रवाई चुनें:
"""

    MODELS_TEXT = "🔤 टेक्स्ट मॉडल"
    MODELS_SUMMARY = "📝 सारांश मॉडल"
    MODELS_IMAGE = "🖼 ग्राफिक मॉडल"
    MODELS_MUSIC = "🎵 संगीत मॉडल"
    MODELS_VIDEO = "📹 वीडियो मॉडल"

    # MusicGen
    MUSIC_GEN_INFO = """
🎺 <b>MusicGen के लिए निर्देश</b>

मैं आपके शब्दों और विवरणों को अनोखी धुनों में बदलने के लिए तैयार हूँ 🎼

मुझे बताएं कि आप कौन-सी संगीत बनाना चाहते हैं: <b>उसका स्टाइल, मूड और इंस्ट्रूमेंट्स का वर्णन करें</b>
"""
    MUSIC_GEN_TYPE_SECONDS = """
⏳ <b>आपकी सिम्फनी कितने सेकंड की होनी चाहिए?</b>

<i>हर 10 सेकंड के लिए 1 जनरेशन का उपयोग होता है</i> 🎼

अपनी कंपोजिशन की अवधि सेकंड्स में लिखें या चुनें:
"""
    MUSIC_GEN_MIN_ERROR = """
🤨 <b>रुकिए!</b>

आप 10 सेकंड से कम का अनुरोध कर रहे हैं!

आगे बढ़ने के लिए, <b>10 या उससे अधिक का नंबर भेजें</b>
"""
    MUSIC_GEN_MAX_ERROR = """
🤨 <b>रुकिए!</b>

आप 10 मिनट से अधिक का अनुरोध कर रहे हैं, फिलहाल मैं इससे लंबा नहीं बना सकता!

जादू शुरू करने के लिए, <b>600 से कम का नंबर दर्ज करें</b>
"""
    MUSIC_GEN_SECONDS_10 = "🔹 10 सेकंड"
    MUSIC_GEN_SECONDS_30 = "🔹 30 सेकंड"
    MUSIC_GEN_SECONDS_60 = "🔹 60 सेकंड (1 मिनट)"
    MUSIC_GEN_SECONDS_180 = "🔹 180 सेकंड (3 मिनट)"
    MUSIC_GEN_SECONDS_300 = "🔹 300 सेकंड (5 मिनट)"
    MUSIC_GEN_SECONDS_600 = "🔹 600 सेकंड (10 मिनट)"

    @staticmethod
    def music_gen_forbidden_error(available_seconds: int) -> str:
        return f"""
🚧 <b>ओह, एक छोटी समस्या!</b>

आपके पास केवल <b>{available_seconds} सेकंड</b> शेष हैं

एक छोटा नंबर दर्ज करें, या अनलिमिटेड संभावनाओं के लिए /buy का उपयोग करें
"""

    # Notify about quota
    @staticmethod
    def notify_about_quota(
        subscription_limits: dict,
    ) -> str:
        texts = [
            f"""
🤖 <b>अरे, ये मैं हूं! मुझे याद है?</b>

🤓 मैं यहां <b>याद दिलाने</b> आया हूं कि आपके दैनिक कोटा हैं:
• <b>{format_number(subscription_limits[Quota.CHAT_GPT4_OMNI_MINI])} टेक्स्ट रिक्वेस्ट</b> जो आपके मास्टरपीस में बदलने का इंतजार कर रहे हैं
• <b>{format_number(subscription_limits[Quota.EIGHTIFY])} वीडियो सारांश</b>, जो वीडियो की भावना को जल्दी से समझने में मदद करेगा
• <b>{format_number(subscription_limits[Quota.STABLE_DIFFUSION_XL])} ग्राफिकल क्षमताएं</b>, जो आपकी कल्पनाओं को जीवंत बनाएंगी

🔥 इन्हें व्यर्थ मत जाने दीजिए — <b>अभी शुरू करें!</b>
""",
            f"""
🤖 <b>नमस्ते, मैं फ्यूज़ी हूं, आपका निजी सहायक</b>!

😢 मैंने देखा कि आपने काफी समय से अपना कोटा उपयोग नहीं किया है। बस <b>याद दिलाने</b> आया हूं कि आपके पास हर दिन:
• <b>{format_number(subscription_limits[Quota.CHAT_GPT4_OMNI_MINI])} टेक्स्ट रिक्वेस्ट</b>, जो आपकी कल्पनाओं को मदद करेंगे
• <b>{format_number(subscription_limits[Quota.EIGHTIFY])} वीडियो सारांश</b>, ताकि आपका समय बच सके
• <b>{format_number(subscription_limits[Quota.STABLE_DIFFUSION_XL])} चित्र</b>, जो आपके विचारों को जीवंत करेगा

✨ <b>चलो, कुछ बनाते हैं!</b> मैं अभी तैयार हूं!
""",
            f"""
🤖 <b>यह फ्यूज़ी है, आपका निजी डिजिटल सहायक, एक महत्वपूर्ण रिमाइंडर के साथ!</b>

🤨 आप जानते हैं कि आपके पास <b>यह सब है</b>:
• <b>{format_number(subscription_limits[Quota.CHAT_GPT4_OMNI_MINI])} टेक्स्ट रिक्वेस्ट</b>, जो आपकी रचनात्मक सोच में मदद करेगा
• <b>{format_number(subscription_limits[Quota.EIGHTIFY])} वीडियो सारांश</b>, जिससे आप तुरंत सार समझ सकते हैं
• <b>{format_number(subscription_limits[Quota.STABLE_DIFFUSION_XL])} चित्र</b>, जिससे आपकी कल्पना को वास्तविकता में बदला जा सकता है

🔋 मैं पहले से तैयार हूं, बस आपको <b>शुरू करने</b> की ज़रूरत है!
""",
            f"""
🤖 <b>ये फिर से मैं हूं! मुझे आपकी याद आई...</b>

😢 मैंने सोचा... आपके <b>कोटा भी आपकी याद कर रहे हैं</b>:
• <b>{format_number(subscription_limits[Quota.CHAT_GPT4_OMNI_MINI])} प्रेरणादायक टेक्स्ट रिक्वेस्ट</b> इंतजार कर रहे हैं
• <b>{format_number(subscription_limits[Quota.EIGHTIFY])} वीडियो सारांश</b>, जो छोटे-छोटे इनसाइट्स में बदल जाएगा
• <b>{format_number(subscription_limits[Quota.STABLE_DIFFUSION_XL])} विज़ुअल आइडिया</b> जो अभी भी जीवंत होने का इंतजार कर रहा है

💡 मुझे आपकी मदद करने का एक मौका दें <b>कुछ असाधारण बनाने</b> में!
""",
            f"""
🤖 <b>नमस्ते, मैं फ्यूज़ी हूं!</b> आपका कोटा खुद का उपयोग नहीं करेगा, आप यह तो समझते हैं?

🫤 <b>याद दिला रहा हूं कि आपके पास:</b>
• <b>{format_number(subscription_limits[Quota.CHAT_GPT4_OMNI_MINI])} टेक्स्ट रिक्वेस्ट</b>, जो आपकी सफलता की शुरुआत हो सकते हैं
• <b>{format_number(subscription_limits[Quota.EIGHTIFY])} वीडियो सारांश</b>, जिससे आप तुरंत सार पकड़ सकें
• <b>{format_number(subscription_limits[Quota.STABLE_DIFFUSION_XL])} चित्र</b>, जो आपकी कल्पना को उकेर सकता है

✨ <b>सृजन का समय है</b>, और मैं यहां मदद के लिए हूं। चलिए, शुरू करते हैं!
""",
        ]

        return random.choice(texts)

    NOTIFY_ABOUT_QUOTA_TURN_OFF = "🔕 नोटिफिकेशन बंद करें"
    NOTIFY_ABOUT_QUOTA_TURN_OFF_SUCCESS = "🎉 नोटिफिकेशन सफलतापूर्वक बंद कर दिया गया"

    # Open
    OPEN_SETTINGS = "⚙️ सेटिंग्स पर जाएं"
    OPEN_BONUS_INFO = "🎁 बोनस बैलेंस देखें"
    OPEN_BUY_SUBSCRIPTIONS_INFO = "💎 सब्सक्रिप्शन खरीदें"
    OPEN_BUY_PACKAGES_INFO = "🛍 पैकेज खरीदें"

    # Package
    PACKAGE = "🛍 पैकेज"
    PACKAGE_SUCCESS = """
🎉 <b>भुगतान सफल हुआ!</b>

आपने सफलतापूर्वक चयनित पैकेज की शक्ति को अनलॉक कर लिया है 🎢

चलिए, चमत्कार करते हैं ✨
"""
    PACKAGE_QUANTITY_MIN_ERROR = """
🚨 <b>अरे!</b>

राशि न्यूनतम सीमा से कम है

कृपया ऐसे पैकेज की संख्या चुनें, जो न्यूनतम आवश्यक राशि के बराबर या उससे अधिक हो 🔄
"""
    PACKAGE_QUANTITY_MAX_ERROR = """
🚨 <b>अरे!</b>

दर्ज किया गया संख्या उस सीमा से अधिक है, जिसे आप खरीद सकते हैं

<b>कृपया छोटा मान दर्ज करें या अपने बैलेंस के अनुसार चुनें</b> 🔄
"""

    @staticmethod
    def package_info(currency: Currency, cost: str, gift_packages: list[Product]) -> str:
        if currency == Currency.USD:
            cost = f"{Currency.SYMBOLS[currency]}{cost}"
            gift_packages_sum = f"{Currency.SYMBOLS[currency]}5"
        else:
            cost = f"{cost}{Currency.SYMBOLS[currency]}"
            gift_packages_sum = f"500{Currency.SYMBOLS[currency]}"

        gift_packages_info = f"\n\n🎁 <span class='tg-spoiler'>{gift_packages_sum} या उससे अधिक खर्च करें — इन पैकेजों को उपहार में पाएं:</span>"
        for gift_package in gift_packages:
            gift_packages_info += f"\n<span class='tg-spoiler'>{gift_package.names.get(LanguageCode.HI)}</span>"

        return f"""
🛍 <b>पैकेज</b>

<b>1 सिक्का 🪙 = {cost}</b>{gift_packages_info if len(gift_packages) > 0 else ''}

पैकेज चुनने के लिए, नीचे दिए गए बटन पर क्लिक करें:
"""

    @staticmethod
    def package_choose_min(name: str) -> str:
        return f"""
आपने पैकेज <b>{name}</b> चुना है।

<b>कृपया मात्रा चुनें या भेजें</b>, जिसे आप खरीदना चाहते हैं
"""

    @staticmethod
    def package_confirmation(package_name: str, package_quantity: int, currency: Currency, price: str) -> str:
        left_price_part = Currency.SYMBOLS[currency] if currency == Currency.USD else ''
        right_price_part = '' if currency == Currency.USD else Currency.SYMBOLS[currency]
        return f"आप <b>{package_name}</b> के {package_quantity} पैकेज {left_price_part}{price}{right_price_part} में खरीदने वाले हैं।"

    @staticmethod
    def payment_package_description(user_id: str, package_name: str, package_quantity: int):
        return f"उपयोगकर्ता: {user_id} के लिए {package_name} के {package_quantity} पैकेज का भुगतान"

    PACKAGES = "🛍 पैकेज"
    PACKAGES_SUCCESS = """
🎉 <b>भुगतान सफल रहा!</b>

आपने सफलतापूर्वक चयनित पैकेजों की शक्ति को अनलॉक कर दिया है 🎢

आइए चमत्कार करें ✨
"""
    PACKAGES_END = """
🕒 <b>ओह-ओह</b>

एक या अधिक पैकेजों का समय समाप्त हो गया है! ⌛

जारी रखने के लिए, नीचे दिए गए बटन पर क्लिक करके मेरे प्रस्ताव देखें:
"""

    @staticmethod
    def packages_description(user_id: str):
        return f"उपयोगकर्ता: {user_id} के लिए पैकेज का भुगतान"

    # Payment
    PAYMENT_BUY = """
🛒 <b>दुकान</b>

💳 <b>सदस्यता</b>
सभी न्यूरल नेटवर्क्स और उपकरणों तक पूर्ण पहुंच प्राप्त करें। चैटिंग, चित्र, संगीत, वीडियो और बहुत कुछ — सब कुछ शामिल है!

🛍 <b>पैकेज</b>
बस वही, जो आवश्यक है! विशिष्ट संख्या में अनुरोध चुनें और केवल वही भुगतान करें, जो आप उपयोग करते हैं।

नीचे दिए गए बटन पर क्लिक करके चुनें 👇
"""
    PAYMENT_CHANGE_CURRENCY = "💱 मुद्रा बदलें"
    PAYMENT_YOOKASSA_PAYMENT_METHOD = "🪆 ЮKassa (रूसी कार्ड)"
    PAYMENT_STRIPE_PAYMENT_METHOD = "🌍 Stripe (अंतर्राष्ट्रीय कार्ड)"
    PAYMENT_TELEGRAM_STARS_PAYMENT_METHOD = "⭐️ Telegram Stars (Telegram मुद्रा)"
    PAYMENT_CHOOSE_PAYMENT_METHOD = """
<b>भुगतान का तरीका चुनें:</b>

🪆 <b>ЮKassa (रूसी कार्ड)</b>

🌍 <b>Stripe (अंतर्राष्ट्रीय कार्ड)</b>

⭐️ <b>Telegram Stars (Telegram मुद्रा)</b>
"""
    PAYMENT_PROCEED_TO_PAY = "🌐 भुगतान के लिए आगे बढ़ें"
    PAYMENT_PROCEED_TO_CHECKOUT = "💳 चेकआउट के लिए आगे बढ़ें"
    PAYMENT_DISCOUNT = "💸 छूट"
    PAYMENT_NO_DISCOUNT = "कोई छूट नहीं"

    @staticmethod
    def payment_purchase_minimal_price(currency: Currency, current_price: str):
        left_part_price = Currency.SYMBOLS[currency] if currency == Currency.USD else ''
        right_part_price = '' if currency == Currency.USD else Currency.SYMBOLS[currency]
        return f"""
<b>😕 ओह-ओह...</b>

खरीदारी करने के लिए न्यूनतम राशि <b>{left_part_price}{1 if currency == Currency.USD else 50}{right_part_price}</b> या उससे अधिक होनी चाहिए।

अभी आपकी खरीदारी की कुल राशि है: <b>{left_part_price}{current_price}{right_part_price}</b>
"""

    # Photoshop AI
    PHOTOSHOP_AI_INFO = """
🪄 <b>फोटोशॉप AI</b>

इस मॉडल में छवि संपादन और स्टाइलिंग के लिए AI टूल्स शामिल हैं।

नीचे दिए गए बटन पर क्लिक करके क्रिया चुनें 👇
"""
    PHOTOSHOP_AI_UPSCALE = "⬆️ गुणवत्ता सुधार"
    PHOTOSHOP_AI_UPSCALE_INFO = """
⬆️ <b>यह टूल मूल छवि की गुणवत्ता को सुधारता है</b>

छवि की गुणवत्ता सुधारने के लिए, अपनी छवि मुझे भेजें।
"""
    PHOTOSHOP_AI_RESTORATION = "🖌 पुनर्स्थापन"
    PHOTOSHOP_AI_RESTORATION_INFO = """
🖌 <b>यह टूल मूल छवि पर खरोंच/कट को पहचानता है और उन्हें हटाता है</b>

खरोंच/कट को हटाने के लिए, अपनी छवि मुझे भेजें।
"""
    PHOTOSHOP_AI_COLORIZATION = "🌈 रंग भरना"
    PHOTOSHOP_AI_COLORIZATION_INFO = """
🌈 <b>यह टूल काले-सफेद छवियों में रंग जोड़ने की अनुमति देता है</b>

काले-सफेद फोटो को रंगीन बनाने के लिए, अपनी छवि मुझे भेजें।
"""
    PHOTOSHOP_AI_REMOVE_BACKGROUND = "🗑 पृष्ठभूमि हटाना"
    PHOTOSHOP_AI_REMOVE_BACKGROUND_INFO = """
🗑 <b>यह टूल छवि की पृष्ठभूमि को हटाने की अनुमति देता है</b>

पृष्ठभूमि को हटाने के लिए, अपनी छवि मुझे भेजें।
"""

    # Profile
    @staticmethod
    def profile(
        subscription_name: str,
        subscription_status: SubscriptionStatus,
        current_model: str,
        renewal_date,
    ) -> str:
        if subscription_status == SubscriptionStatus.CANCELED:
            subscription_info = f"📫 <b>सदस्यता की स्थिति:</b> रद्द की गई। {renewal_date} तक सक्रिय"
        elif subscription_status == SubscriptionStatus.TRIAL:
            subscription_info = f"📫 <b>सदस्यता की स्थिति:</b> निःशुल्क परीक्षण अवधि"
        else:
            subscription_info = "📫 <b>सदस्यता की स्थिति:</b> सक्रिय"

        return f"""
👤 <b>प्रोफाइल</b>

─────────────

🤖 <b>वर्तमान मॉडल: {current_model}</b>

💳 <b>सदस्यता प्रकार:</b> {subscription_name}
🗓 <b>सदस्यता नवीनीकरण की तिथि:</b> {f'{renewal_date}' if subscription_name != '🆓' else 'N/A'}
{subscription_info}

─────────────

कार्यवाही का चयन करें 👇
"""

    @staticmethod
    def profile_quota(
        subscription_limits: dict,
        daily_limits,
        additional_usage_quota,
    ) -> str:
        hours, minutes = get_time_until_limit_update()

        return f"""
🤖 <b>कोटा:</b>

─────────────

🔤 <b>पाठ्य मॉडल</b>:
<b>मूलभूत</b>:
    ┣ ✉️ ChatGPT 4.0 Omni Mini{f': अतिरिक्त {additional_usage_quota[Quota.CHAT_GPT4_OMNI_MINI]}' if additional_usage_quota[Quota.CHAT_GPT4_OMNI_MINI] > 0 else ''}
    ┣ 📜 Claude 3.5 Haiku{f': अतिरिक्त {additional_usage_quota[Quota.CLAUDE_3_HAIKU]}' if additional_usage_quota[Quota.CLAUDE_3_HAIKU] > 0 else ''}
    ┣ 🏎 Gemini 2.0 Flash{f': अतिरिक्त {additional_usage_quota[Quota.GEMINI_2_FLASH]}' if additional_usage_quota[Quota.GEMINI_2_FLASH] > 0 else ''}
    ┗ दैनिक सीमा: {format_number(daily_limits[Quota.CHAT_GPT4_OMNI_MINI])}/{format_number(subscription_limits[Quota.CHAT_GPT4_OMNI_MINI])}

<b>उन्नत</b>:
    ┣ 💥 ChatGPT 4.0 Omni{f': अतिरिक्त {additional_usage_quota[Quota.CHAT_GPT4_OMNI]}' if additional_usage_quota[Quota.CHAT_GPT4_OMNI] > 0 else ''}
    ┣ 🧩 ChatGPT o3-mini{f': अतिरिक्त {additional_usage_quota[Quota.CHAT_GPT_O_3_MINI]}' if additional_usage_quota[Quota.CHAT_GPT_O_3_MINI] > 0 else ''}
    ┣ 💫 Claude 3.5 Sonnet{f': अतिरिक्त {additional_usage_quota[Quota.CLAUDE_3_SONNET]}' if additional_usage_quota[Quota.CLAUDE_3_SONNET] > 0 else ''}
    ┣ 💼 Gemini 1.5 Pro{f': अतिरिक्त {additional_usage_quota[Quota.GEMINI_1_PRO]}' if additional_usage_quota[Quota.GEMINI_1_PRO] > 0 else ''}
    ┣ 🐦 Grok 2.0{f': अतिरिक्त {additional_usage_quota[Quota.GROK_2]}' if additional_usage_quota[Quota.GROK_2] > 0 else ''}
    ┣ 🌐 Perplexity{f': अतिरिक्त {additional_usage_quota[Quota.PERPLEXITY]}' if additional_usage_quota[Quota.PERPLEXITY] > 0 else ''}
    ┗ दैनिक सीमा: {format_number(daily_limits[Quota.CHAT_GPT4_OMNI])}/{format_number(subscription_limits[Quota.CHAT_GPT4_OMNI])}

<b>फ्लैगशिप</b>:
    ┣ 🧪 ChatGPT o1{f': अतिरिक्त {additional_usage_quota[Quota.CHAT_GPT_O_1]}' if additional_usage_quota[Quota.CHAT_GPT_O_1] > 0 else ''}
    ┣ 🚀 Claude 3.0 Opus{f': अतिरिक्त {additional_usage_quota[Quota.CLAUDE_3_OPUS]}' if additional_usage_quota[Quota.CLAUDE_3_OPUS] > 0 else ''}
    ┣ 🛡️ Gemini 1.0 Ultra{f': अतिरिक्त {additional_usage_quota[Quota.GEMINI_1_ULTRA]}' if additional_usage_quota[Quota.GEMINI_1_ULTRA] > 0 else ''}
    ┗ दैनिक सीमा: {format_number(daily_limits[Quota.CHAT_GPT_O_1])}/{format_number(subscription_limits[Quota.CHAT_GPT_O_1])}

─────────────

📝 <b>सारांश मॉडल</b>:
    ┣ 👀 YouTube{f': अतिरिक्त {additional_usage_quota[Quota.EIGHTIFY]}' if additional_usage_quota[Quota.EIGHTIFY] > 0 else ''}
    ┣ 📼 वीडियो{f': अतिरिक्त {additional_usage_quota[Quota.GEMINI_VIDEO]}' if additional_usage_quota[Quota.GEMINI_VIDEO] > 0 else ''}
    ┗ दैनिक सीमा: {format_number(daily_limits[Quota.EIGHTIFY])}/{format_number(subscription_limits[Quota.EIGHTIFY])}

─────────────

🖼 <b>ग्राफिक मॉडल</b>:
<b>मूलभूत</b>:
    ┣ 🦄 Stable Diffusion XL{f': доп. {additional_usage_quota[Quota.STABLE_DIFFUSION_XL]}' if additional_usage_quota[Quota.STABLE_DIFFUSION_XL] > 0 else ''}
    ┣ 🌲 Flux 1.0 Dev{f': доп. {additional_usage_quota[Quota.FLUX_1_DEV]}' if additional_usage_quota[Quota.FLUX_1_DEV] > 0 else ''}
    ┣ 🌌 Luma Photon{f': доп. {additional_usage_quota[Quota.LUMA_PHOTON]}' if additional_usage_quota[Quota.LUMA_PHOTON] > 0 else ''}
    ┗ दैनिक सीमा: {format_number(daily_limits[Quota.STABLE_DIFFUSION_XL])}/{format_number(subscription_limits[Quota.STABLE_DIFFUSION_XL])}

<b>उन्नत</b>:
    ┣ 👨‍🎨 DALL-E 3{f': अतिरिक्त {additional_usage_quota[Quota.DALL_E]}' if additional_usage_quota[Quota.DALL_E] > 0 else ''}
    ┣ 🎨 Midjourney 6.1{f': अतिरिक्त {additional_usage_quota[Quota.MIDJOURNEY]}' if additional_usage_quota[Quota.MIDJOURNEY] > 0 else ''}
    ┣ 🧑‍🚀 Stable Diffusion 3.5{f': अतिरिक्त {additional_usage_quota[Quota.STABLE_DIFFUSION_3]}' if additional_usage_quota[Quota.STABLE_DIFFUSION_3] > 0 else ''}
    ┣ 🏔 Flux 1.1 Pro{f': अतिरिक्त {additional_usage_quota[Quota.FLUX_1_PRO]}' if additional_usage_quota[Quota.FLUX_1_PRO] > 0 else ''}
    ┣ 🐼 Recraft 3{f': अतिरिक्त {additional_usage_quota[Quota.RECRAFT]}' if additional_usage_quota[Quota.RECRAFT] > 0 else ''}
    ┣ 🌌 Luma Photon{f': अतिरिक्त {additional_usage_quota[Quota.LUMA_PHOTON]}' if additional_usage_quota[Quota.LUMA_PHOTON] > 0 else ''}
    ┣ 📷 FaceSwap{f': अतिरिक्त {additional_usage_quota[Quota.FACE_SWAP]}' if additional_usage_quota[Quota.FACE_SWAP] > 0 else ''}
    ┣ 🪄 Photoshop AI{f': अतिरिक्त {additional_usage_quota[Quota.PHOTOSHOP_AI]}' if additional_usage_quota[Quota.PHOTOSHOP_AI] > 0 else ''}
    ┗ दैनिक सीमा: {format_number(daily_limits[Quota.DALL_E])}/{format_number(subscription_limits[Quota.DALL_E])}

─────────────

🎵 <b>संगीत मॉडल</b>:
    ┣ 🎺 MusicGen{f': अतिरिक्त {additional_usage_quota[Quota.MUSIC_GEN]}' if additional_usage_quota[Quota.MUSIC_GEN] > 0 else ''}
    ┣ 🎸 Suno{f': अतिरिक्त {additional_usage_quota[Quota.SUNO]}' if additional_usage_quota[Quota.SUNO] > 0 else ''}
    ┗ दैनिक सीमा: {format_number(daily_limits[Quota.SUNO])}/{format_number(subscription_limits[Quota.SUNO])}

─────────────

📹 <b>वीडियो मॉडल</b>:
    ┣ 🎬 Kling{f': अतिरिक्त {additional_usage_quota[Quota.KLING]}' if additional_usage_quota[Quota.KLING] > 0 else ''}
    ┣ 🎥 Runway{f': अतिरिक्त {additional_usage_quota[Quota.RUNWAY]}' if additional_usage_quota[Quota.RUNWAY] > 0 else ''}
    ┣ 🔆 Luma Ray{f': अतिरिक्त {additional_usage_quota[Quota.LUMA_RAY]}' if additional_usage_quota[Quota.LUMA_RAY] > 0 else ''}
    ┗ 🐇 Pika{f': अतिरिक्त {additional_usage_quota[Quota.PIKA]}' if additional_usage_quota[Quota.PIKA] > 0 else ''}

─────────────

📷 <b>फोटो/दस्तावेज़ के साथ काम</b>: {'✅' if daily_limits[Quota.WORK_WITH_FILES] or additional_usage_quota[Quota.WORK_WITH_FILES] else '❌'}
🎭 <b>डिजिटल कर्मचारी कैटलॉग तक पहुंच</b>: {'✅' if daily_limits[Quota.ACCESS_TO_CATALOG] or additional_usage_quota[Quota.ACCESS_TO_CATALOG] else '❌'}
🎙 <b>वॉयस मैसेज</b>: {'✅' if daily_limits[Quota.VOICE_MESSAGES] or additional_usage_quota[Quota.VOICE_MESSAGES] else '❌'}
⚡ <b>फास्ट मैसेज</b>: {'✅' if daily_limits[Quota.FAST_MESSAGES] or additional_usage_quota[Quota.FAST_MESSAGES] else '❌'}

─────────────

🔄 <i>सीमा {hours} घंटे {minutes} मिनट में रीसेट होगी</i>
"""

    PROFILE_SHOW_QUOTA = "🔄 कोटा दिखाएं"
    PROFILE_TELL_ME_YOUR_GENDER = "कृपया अपना लिंग बताएं:"
    PROFILE_YOUR_GENDER = "आपका लिंग:"
    PROFILE_SEND_ME_YOUR_PICTURE = """
📸 <b>अपनी फोटो मुझे भेजें</b>

👍 <b>सही फोटो के लिए सिफारिशें:</b>
• स्पष्ट और उच्च गुणवत्ता वाला सेल्फी।
• सेल्फी में केवल एक व्यक्ति हो।

👎 <b>कृपया इन फोटो से बचें:</b>
• समूह फोटो।
• जानवर।
• 18 वर्ष से कम उम्र के बच्चे।
• पूरी लंबाई वाली फोटो।
• अशोभनीय या नग्न तस्वीरें।
• धूप के चश्मे या चेहरा ढकने वाली कोई वस्तु।
• धुंधली या फोकस से बाहर तस्वीरें।
• वीडियो और एनिमेशन।
• संकुचित या संशोधित छवियां।

जैसे ही आप सही फोटो पाएं, <b>अपनी फोटो अपलोड करें</b> और जादू शुरू होने दें 🌟
"""
    PROFILE_UPLOAD_PHOTO = "📷 फोटो अपलोड करें"
    PROFILE_UPLOADING_PHOTO = "फोटो अपलोड हो रही है..."
    PROFILE_CHANGE_PHOTO = "📷 फोटो बदलें"
    PROFILE_CHANGE_PHOTO_SUCCESS = "📸 फोटो सफलतापूर्वक अपलोड हो गई!"
    PROFILE_RENEW_SUBSCRIPTION = "♻️ सदस्यता नवीनीकरण करें"
    PROFILE_RENEW_SUBSCRIPTION_SUCCESS = "✅ सदस्यता का नवीनीकरण सफल रहा"
    PROFILE_CANCEL_SUBSCRIPTION = "❌ सदस्यता रद्द करें"
    PROFILE_CANCEL_SUBSCRIPTION_CONFIRMATION = "❗ क्या आप वाकई अपनी सदस्यता रद्द करना चाहते हैं?"
    PROFILE_CANCEL_SUBSCRIPTION_SUCCESS = "💸 सदस्यता रद्द करना सफल रहा"
    PROFILE_NO_ACTIVE_SUBSCRIPTION = "💸 आपके पास कोई सक्रिय सदस्यता नहीं है"

    # Promo code
    PROMO_CODE_ACTIVATE = "🔑 प्रोमो कोड सक्रिय करें"
    PROMO_CODE_INFO = """
🔓 <b>प्रोमो कोड सक्रियकरण</b>

अगर आपके पास प्रोमो कोड है, तो उसे भेजें और छिपी हुई सुविधाओं और खास सरप्राइज को अनलॉक करें 🔑
"""
    PROMO_CODE_SUCCESS = """
🎉 <b>आपका प्रोमो कोड सफलतापूर्वक सक्रिय हो गया है!</b>

अन्वेषण का आनंद लें! 🚀
"""
    PROMO_CODE_ALREADY_HAVE_SUBSCRIPTION = """
🚫 <b>ओह!</b>

आप पहले से ही हमारे विशेष सब्सक्रिप्शन क्लब के सदस्य हैं! 🌟
"""
    PROMO_CODE_EXPIRED_ERROR = """
🕒 <b>यह प्रोमो कोड अब पुराना हो चुका है!</b>

मुझे कोई और कोड भेजें या नीचे दिए गए विकल्प में से कोई एक चुनें:
"""
    PROMO_CODE_NOT_FOUND_ERROR = """
🔍 <b>प्रोमो कोड नहीं मिला!</b>

आपके द्वारा डाला गया प्रोमो कोड सिस्टम में नहीं पाया गया 🕵️‍♂️

🤔 <b>कृपया किसी भी टाइपिंग गलती की जांच करें और फिर से प्रयास करें</b>। यदि अभी भी काम नहीं करता है, तो कोई दूसरा कोड देखें या /buy में उपलब्ध ऑफ़र पर नज़र डालें, वहां शानदार डील्स हैं 🛍️
"""
    PROMO_CODE_ALREADY_USED_ERROR = """
🚫 <b>पहले से इस्तेमाल किया हुआ!</b>

आप पहले ही इस प्रोमो कोड का उपयोग कर चुके हैं। यह जादू एक बार के लिए था, और आपने इसे पहले ही इस्तेमाल कर लिया है! 🧙

लेकिन चिंता न करें! आप नीचे दिए गए विकल्प का उपयोग करके मेरे ऑफ़र देख सकते हैं:
"""

    # Remove Restriction
    REMOVE_RESTRICTION = "⛔️ प्रतिबंध हटाएं"
    REMOVE_RESTRICTION_INFO = "प्रतिबंध हटाने के लिए, नीचे दिए गए क्रियाओं में से एक चुनें 👇"

    # Settings
    @staticmethod
    def settings_info(human_model: str, current_model: Model, generation_cost=1) -> str:
        if current_model == Model.DALL_E:
            additional_text = f"\nवर्तमान सेटिंग्स पर 1 अनुरोध की कीमत है: {generation_cost} 🖼"
        elif current_model == Model.KLING or current_model == Model.RUNWAY or current_model == Model.LUMA_RAY:
            additional_text = f"\nवर्तमान सेटिंग्स पर 1 अनुरोध की कीमत है: {generation_cost} 📹"
        else:
            additional_text = ""

        return f"""
⚙️ <b>मॉडल के लिए सेटिंग्स:</b> {human_model}

यहां आप चुने हुए मॉडल को अपनी आवश्यकताओं और प्राथमिकताओं के अनुसार अनुकूलित कर सकते हैं
{additional_text}
"""

    SETTINGS_CHOOSE_MODEL_TYPE = """
⚙️ <b>सेटिंग्स</b>

🤖 मॉडल बदलने के लिए, कमांड दर्ज करें /model
🌍 इंटरफ़ेस भाषा बदलने के लिए, कमांड दर्ज करें /language

नीचे उस मॉडल का प्रकार चुनें, जिसे आप अपनी पसंद के अनुसार सेट करना चाहते हैं 👇
"""
    SETTINGS_CHOOSE_MODEL = """
⚙️ <b>सेटिंग्स</b>

नीचे से उस मॉडल का चयन करें जिसे आप अपने अनुसार अनुकूलित करना चाहते हैं 👇
"""
    SETTINGS_VOICE_MESSAGES = """
⚙️ <b>सेटिंग्स</b>

सभी टेक्स्ट मॉडल्स के लिए वॉयस उत्तर सेटिंग्स नीचे उपलब्ध हैं 🎙
"""
    SETTINGS_VERSION = "🤖 संस्करण"
    SETTINGS_FOCUS = "🎯 फोकस"
    SETTINGS_FORMAT = "🎛 स्वरूप"
    SETTINGS_AMOUNT = "📏 उत्तर की लंबाई"
    SETTINGS_SEND_TYPE = "🗯 भेजने का प्रकार"
    SETTINGS_SEND_TYPE_IMAGE = "🖼 छवि"
    SETTINGS_SEND_TYPE_DOCUMENT = "📄 दस्तावेज़"
    SETTINGS_SEND_TYPE_AUDIO = "🎤 ऑडियो"
    SETTINGS_SEND_TYPE_VIDEO = "📺 वीडियो"
    SETTINGS_ASPECT_RATIO = "📐 आस्पेक्ट अनुपात"
    SETTINGS_QUALITY = "✨ गुणवत्ता"
    SETTINGS_PROMPT_SAFETY = "🔐 प्रॉम्प्ट-सुरक्षा"
    SETTINGS_GENDER = "👕/👚 लिंग"
    SETTINGS_DURATION = "📏 सेकंड में अवधि"
    SETTINGS_MODE = "🤖 मोड"
    SETTINGS_SHOW_THE_NAME_OF_THE_CHATS = "संदेशों में चैट के नाम दिखाएं"
    SETTINGS_SHOW_THE_NAME_OF_THE_ROLES = "संदेशों में भूमिकाओं के नाम दिखाएं"
    SETTINGS_SHOW_USAGE_QUOTA_IN_MESSAGES = "संदेशों में उपयोग की सीमा दिखाएं"
    SETTINGS_TURN_ON_VOICE_MESSAGES = "वॉयस उत्तर चालू करें"
    SETTINGS_LISTEN_VOICES = "आवाजों को सुनें"

    # Shopping cart
    SHOPPING_CART = "🛒 शॉपिंग कार्ट"
    SHOPPING_CART_ADD = "➕ कार्ट में जोड़ें"

    @staticmethod
    def shopping_cart_add_or_buy_now(
        product: Product,
        product_quantity: int,
        product_price: float,
        currency: Currency,
    ):
        return f"""
<b>{product_quantity} पैकेज {product.names.get(LanguageCode.ES)} – {format_number(product_price)}{Currency.SYMBOLS[currency]}</b>
"""

    SHOPPING_CART_BUY_NOW = "🛍 अभी खरीदें"
    SHOPPING_CART_REMOVE = "➖ कार्ट से हटाएं"
    SHOPPING_CART_GO_TO = "🛒 कार्ट खोलें"
    SHOPPING_CART_GO_TO_OR_CONTINUE_SHOPPING = "कार्ट पर जाएं या खरीदारी जारी रखें?"
    SHOPPING_CART_CONTINUE_SHOPPING = "🛍 खरीदारी जारी रखें"
    SHOPPING_CART_CLEAR = "🗑 कार्ट साफ करें"

    @staticmethod
    async def shopping_cart_info(currency: Currency, cart_items: list[dict], discount: int):
        text = ""
        total_sum = 0
        left_price_part = Currency.SYMBOLS[currency] if currency == Currency.USD else ''
        right_price_part = '' if currency == Currency.USD else Currency.SYMBOLS[currency]

        for index, cart_item in enumerate(cart_items):
            product_id, product_quantity = cart_item.get("product_id", ''), cart_item.get("quantity", 0)

            product = await get_product(product_id)

            is_last = index == len(cart_items) - 1
            right_part = '\n' if not is_last else ''
            price = Product.get_discount_price(
                ProductType.PACKAGE,
                product_quantity,
                product.prices.get(currency),
                currency,
                discount,
            )
            total_sum += float(price)
            text += f"{index + 1}. {product.names.get(LanguageCode.HI)}: {product_quantity} ({left_price_part}{price}{right_price_part}){right_part}"

        if not text:
            text = "आपकी कार्ट खाली है"

        return f"""
🛒 <b>शॉपिंग कार्ट</b>

{text}

💳 <b>भुगतान करने योग्य राशि:</b> {left_price_part}{round(total_sum, 2)}{right_price_part}
"""

    @staticmethod
    async def shopping_cart_confirmation(cart_items: list[dict], currency: Currency, price: float) -> str:
        text = ""
        for index, cart_item in enumerate(cart_items):
            product_id, product_quantity = cart_item.get("product_id", ''), cart_item.get("quantity", 0)

            product = await get_product(product_id)

            text += f"{index + 1}. {product.names.get(LanguageCode.HI)}: {product_quantity}\n"

        if currency == Currency.USD:
            total_sum = f"{Currency.SYMBOLS[currency]}{price}"
        else:
            total_sum = f"{price}{Currency.SYMBOLS[currency]}"

        return f"""
आप निम्नलिखित पैकेज अपनी कार्ट से खरीदने वाले हैं:
{text}

कुल भुगतान: {total_sum}
"""

    # Start
    START_INFO = """
👋 <b>नमस्ते!</b>

🤓 <b>मैं हूँ आपका सहायक, जो आपको न्यूरल नेटवर्क की दुनिया में मदद करता है</b>

<b>मेरे साथ आप बना सकते हैं:</b>
💭 टेक्स्ट /text
📝 सारांश /summary
🖼️ चित्र /image
🎵 संगीत /music
📹 वीडियो /video

🏆 <b>मेरा मिशन है सबको बेहतरीन न्यूरल नेटवर्क्स तक पहुँच देना</b>

🤖 सभी उपलब्ध मॉडल्स आप देख सकते हैं /model

ℹ️ न्यूरल नेटवर्क्स के बारे में अधिक जानने के लिए और वे क्या कर सकते हैं, /info पर जाएं

✨ <b>अभी से अपनी रचनात्मकता शुरू करें!</b>
"""
    START_QUICK_GUIDE = "📖 त्वरित मार्गदर्शिका"
    START_QUICK_GUIDE_INFO = """
📖 <b>त्वरित मार्गदर्शिका</b>

─────────────

💭 <b>टेक्स्ट उत्तर</b>:
1️⃣ कमांड दर्ज करें /text
2️⃣ मॉडल चुनें
3️⃣ चैट में अपने प्रश्न लिखें

<i>अतिरिक्त</i>

📷 अगर आप मुझे एक तस्वीर भेजते हैं, तो मैं:
• उस पर आपके किसी भी सवाल का जवाब दे सकता हूँ
• टेक्स्ट को पहचान सकता हूँ
• समस्या को हल कर सकता हूँ

🌐 आप इंटरनेट से जानकारी प्राप्त कर सकते हैं <b>Perplexity</b> /perplexity

─────────────

📝 <b>सारांश</b>:
1️⃣ कमांड दर्ज करें /summary
2️⃣ मॉडल चुनें
3️⃣ वीडियो या उसकी लिंक भेजें

─────────────

🖼 <b>चित्र बनाना</b>:
1️⃣ कमांड दर्ज करें /image
2️⃣ मॉडल चुनें
3️⃣ चैट में अपने अनुरोध लिखें

<i>अतिरिक्त</i>
📷 अगर आप मुझे एक तस्वीर भेजते हैं, तो मैं:
• विवरण/तत्व जोड़ सकता हूँ
• छवि की शैली बदल सकता हूँ
• कुछ नया दृश्य बना सकता हूँ

─────────────

📷️ <b>फोटो पर चेहरे बदलना</b>:
1️⃣ कमांड दर्ज करें /face_swap
2️⃣ निर्देशों का पालन करें

─────────────

🪄 <b>छवि संपादन</b>:
1️⃣ कमांड दर्ज करें /photoshop
2️⃣ निर्देशों का पालन करें

─────────────

🎵 <b>संगीत बनाना</b>:
1️⃣ कमांड दर्ज करें /music
2️⃣ मॉडल चुनें
3️⃣ निर्देशों का पालन करें

─────────────

📹 <b>वीडियो बनाना</b>:
1️⃣ कमांड दर्ज करें /video
2️⃣ मॉडल चुनें
3️⃣ निर्देशों का पालन करें
"""

    # Subscription
    SUBSCRIPTION = "💳 सदस्यता"
    SUBSCRIPTIONS = "💳 सदस्यताएँ"
    SUBSCRIPTION_MONTH_1 = "1 महीना"
    SUBSCRIPTION_MONTHS_3 = "3 महीने"
    SUBSCRIPTION_MONTHS_6 = "6 महीने"
    SUBSCRIPTION_MONTHS_12 = "12 महीने"
    SUBSCRIPTION_SUCCESS = """
🎉 <b>आपकी सदस्यता सक्रिय हो गई है!</b>

आगे यह सब आपका इंतजार कर रहा है:
• आपके सामने संभावनाओं की पूरी दुनिया खुल गई है 🌍
• AI दोस्त आपकी मदद के लिए तैयार हैं 🤖
• तैयार हो जाइए ढेर सारी सुविधाओं और मस्ती में डूबने के लिए 🌊

चलिए चमत्कार करते हैं 🪄
"""
    SUBSCRIPTION_RESET = """
🚀 <b>सदस्यता नवीनीकृत हो गई है!</b>

नमस्ते, न्यूरल नेटवर्क्स की दुनिया के यात्री! 👋

आपकी सदस्यता सफलतापूर्वक नवीनीकृत कर दी गई है! चलिए इस महीने को और भी शानदार बनाते हैं 💪
"""
    SUBSCRIPTION_RETRY = """
❗️ <b>सदस्यता नवीनीकरण असफल रहा</b>

आज भुगतान सफल नहीं हुआ। कल एक और प्रयास किया जाएगा।

अगर फिर से असफल होता है, तो सदस्यता समाप्त हो जाएगी।
"""
    SUBSCRIPTION_END = """
🛑 <b>सदस्यता समाप्त हो गई है!</b>

आपकी सदस्यता समाप्त हो गई है। लेकिन चिंता न करें, न्यूरल नेटवर्क्स की दुनिया की यात्रा अभी खत्म नहीं हुई है 🚀

आप अपने अन्वेषण को जारी रख सकते हैं और अपनी पहुँच को फिर से सक्रिय कर सकते हैं नीचे दिए गए बटन पर क्लिक करके:
"""
    SUBSCRIPTION_MONTHLY = "मासिक"
    SUBSCRIPTION_YEARLY = "वार्षिक"

    @staticmethod
    def subscription_description(user_id: str, name: str):
        return f"सदस्यता का भुगतान {name} उपयोगकर्ता के लिए: {user_id}"

    @staticmethod
    def subscription_renew_description(user_id: str, name: str):
        return f"सदस्यता नवीनीकरण {name} उपयोगकर्ता के लिए: {user_id}"

    @staticmethod
    def subscribe(
        subscriptions: list[Product],
        currency: Currency,
        user_discount: int,
        is_trial=False,
    ) -> str:
        text_subscriptions = ''
        for subscription in subscriptions:
            subscription_name = subscription.names.get(LanguageCode.HI)
            subscription_price = subscription.prices.get(currency)
            left_part_price = Currency.SYMBOLS[currency] if currency == Currency.USD else ''
            right_part_price = Currency.SYMBOLS[currency] if currency != Currency.USD else ''
            if subscription_name and subscription_price:
                is_trial_info = ''

                if is_trial and currency == Currency.RUB:
                    is_trial_info = 'पहले 3 दिन 1₽, फिर '
                elif is_trial and currency == Currency.USD:
                    is_trial_info = 'पहले 3 दिन मुफ्त, फिर '

                text_subscriptions += f'<b>{subscription_name}</b>: '
                per_period = 'प्रति महीना' if subscription.category == ProductCategory.MONTHLY else 'प्रति वर्ष'

                discount = get_user_discount(user_discount, 0, subscription.discount)
                if discount:
                    discount_price = Product.get_discount_price(
                        ProductType.SUBSCRIPTION,
                        1,
                        subscription_price,
                        currency,
                        discount,
                        SubscriptionPeriod.MONTH1 if subscription.category == ProductCategory.MONTHLY else SubscriptionPeriod.MONTHS12,
                    )
                    text_subscriptions += f'{is_trial_info}<s>{left_part_price}{subscription_price}{right_part_price}</s> {left_part_price}{discount_price}{right_part_price} {per_period}\n'
                else:
                    text_subscriptions += f'{is_trial_info}{left_part_price}{subscription_price}{right_part_price} {per_period}\n'

        return f"""
💳 <b>सदस्यताएँ</b>

{text_subscriptions}
अपना विकल्प चुनें और सदस्यता लेने के लिए नीचे दिए गए बटन पर क्लिक करें:
"""

    @staticmethod
    def subscribe_confirmation(
        name: str,
        category: ProductCategory,
        currency: Currency,
        price: Union[str, int, float],
        is_trial: bool,
    ) -> str:
        left_price_part = Currency.SYMBOLS[currency] if currency == Currency.USD else ''
        right_price_part = '' if currency == Currency.USD else Currency.SYMBOLS[currency]
        period = 'महीना' if category == ProductCategory.MONTHLY else 'वर्ष'

        trial_info = ''
        if is_trial:
            trial_info = ' पहले 3 दिन के परीक्षण अवधि के साथ'

        return f"""
आप {name} सदस्यता को {left_price_part}{price}{right_price_part}/{period}{trial_info} में सक्रिय करने जा रहे हैं।

❗️सदस्यता को किसी भी समय <b>प्रोफ़ाइल 👤</b> अनुभाग में रद्द किया जा सकता है।
"""

    # Suno
    SUNO_INFO = """
🤖 <b>अपनी गीत की शैली चुनें:</b>

🎹 <b>साधारण मोड</b> में आपको केवल यह बताना होगा कि गीत किस बारे में है और कौन से शैली में होगा।
🎸 <b>विस्तारित मोड</b> में आप अपना खुद का टेक्स्ट इस्तेमाल कर सकते हैं और शैलियों के साथ प्रयोग कर सकते हैं।

<b>Suno</b> 2 ट्रैक बनाएगा, प्रत्येक 4 मिनट तक 🎧
"""
    SUNO_SIMPLE_MODE = "🎹 साधारण"
    SUNO_CUSTOM_MODE = "🎸 विस्तारित"
    SUNO_SIMPLE_MODE_PROMPT = """
🎶 <b>गीत का वर्णन</b>

साधारण मोड में, मैं आपकी इच्छाओं और संगीत के स्वाद का उपयोग करते हुए गीत बनाऊंगा।

<b>अपनी इच्छाएँ भेजें</b> 📝
"""
    SUNO_CUSTOM_MODE_LYRICS = """
🎤 <b>गीत का टेक्स्ट</b>

विस्तारित मोड में, मैं आपके गीत के टेक्स्ट का उपयोग करके एक गीत बनाऊंगा।

<b>गीत का टेक्स्ट भेजें</b> ✍️
"""
    SUNO_CUSTOM_MODE_GENRES = """
🎵 <b>शैली का चयन</b>

ताकि आपका गीत विस्तारित मोड में आपकी पसंद को सही से दर्शाए, कृपया उन शैलियों को बताएं जिन्हें आप शामिल करना चाहते हैं। शैली का चयन गीत के मूड और शैली पर गहरा प्रभाव डालता है, इसलिए इसे ध्यान से चुनें।

<b>अपनी पसंदीदा शैलियों को कॉमा द्वारा अलग कर भेजें</b> और मैं आपकी अनोखी गीत की रचना शुरू करूंगा 🔍
"""
    SUNO_START_AGAIN = "🔄 फिर से शुरू करें"
    SUNO_TOO_MANY_WORDS_ERROR = """
🚧 <b>ओह-ओह!</b>

किसी चरण पर आपने बहुत लंबा टेक्स्ट भेज दिया है 📝

कृपया फिर से कोशिश करें, लेकिन इस बार टेक्स्ट को छोटा रखें।
"""
    SUNO_VALUE_ERROR = """
🧐 <b>यह प्रोम्प्ट जैसा नहीं लगता</b>

कृपया, एक अलग मान भेजें।
"""
    SUNO_SKIP = "⏩️ छोड़ें"

    # Tech Support
    TECH_SUPPORT = "👨‍💻 तकनीकी सहायता"

    # Terms Link
    TERMS_LINK = "https://telegra.ph/Terms-of-Service-in-GPTsTurboBot-05-07"

    # Video Summary
    VIDEO_SUMMARY_FOCUS_INSIGHTFUL = "💡 गहन"
    VIDEO_SUMMARY_FOCUS_FUNNY = "😄 मज़ेदार"
    VIDEO_SUMMARY_FOCUS_ACTIONABLE = "🛠 उपयोगी"
    VIDEO_SUMMARY_FOCUS_CONTROVERSIAL = "🔥 विवादास्पद"
    VIDEO_SUMMARY_FORMAT_LIST = "📋 सूची"
    VIDEO_SUMMARY_FORMAT_FAQ = "🗯 प्रश्न/उत्तर"
    VIDEO_SUMMARY_AMOUNT_AUTO = "⚙️ स्वचालित"
    VIDEO_SUMMARY_AMOUNT_SHORT = "✂️ संक्षेप"
    VIDEO_SUMMARY_AMOUNT_DETAILED = "📚 विस्तृत"

    # Voice
    VOICE_MESSAGES = "आवाज़ी उत्तर 🎙"
    VOICE_MESSAGES_FORBIDDEN_ERROR = """
🎙 <b>ओह!</b>

आपकी आवाज़ AI-स्पेस में खो गई है!

<b>वॉयस को टेक्स्ट में बदलने के चमत्कार को अनलॉक करने के लिए</b>, नीचे दिए गए जादुई बटनों का उपयोग करें:
"""

    # Work with files
    WORK_WITH_FILES = "📷 फोटो/दस्तावेज़ के साथ काम करें"
    WORK_WITH_FILES_FORBIDDEN_ERROR = """
🔒 <b>आप वीआईपी ज़ोन में प्रवेश कर चुके हैं!</b>

आपके पास फिलहाल फोटो और दस्तावेज़ के साथ काम करने की पहुंच नहीं है।

आप नीचे दिए गए बटन पर क्लिक करके पहुंच प्राप्त कर सकते हैं:
"""
